----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_collinear.log
  log type:  text
 opened on:  10 Dec 2025, 16:36:27
version 19.5
c:\ian\git\pllf\pllf.ado
*! v1.3.10 PR 04mar2023 / IW 10dec2025

. /*
> Test that the code handles collinearity
> test_collinear.do
> IW 23jul2025
> */
. 
. pda

. 
. clear

. input Z Y n

             Z          Y          n
  1. 0 0 38
  2. 0 1 4
  3. 1 0 36
  4. 1 1 1
  5. end

. tab Z Y [fw=n]

           |           Y
         Z |         0          1 |     Total
-----------+----------------------+----------
         0 |        38          4 |        42 
         1 |        36          1 |        37 
-----------+----------------------+----------
     Total |        74          5 |        79 

. 
. * correct command
. pllf, profile(Z): logit Y Z [fw=n]
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching......


-------------------------------------------------------------
           Y |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           Z | -1.332227     1.26688    -4.330427    .6356513
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI
Graph command stored as F9

. local ref = r(l_llci)

. 
. * duplicated covariate: fails by default
. cap noi pllf, profile(Z): logit Y Z Z [fw=n]
note: Z omitted because of collinearity.
Collinearity found in xvarlist:  Z Z

. assert _rc==498

. 
. * duplicated covariate: succeeds with dropcol option
. pllf, profile(Z) dropcol: logit Y Z Z [fw=n]
note: Z omitted because of collinearity.
Collinearity found in xvarlist:  Z Z
dropcollinear option --> reduced xvarlist: Z
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching......


-------------------------------------------------------------
           Y |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           Z | -1.332227     1.26688    -4.330427    .6356513
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI
Graph command stored as F9

. assert `ref' == r(l_llci)

. 
. * identical covariate: fails by default
. gen Z2=Z
(96 missing values generated)

. cap noi pllf, profile(Z): logit Y Z2 Z [fw=n]
note: Z omitted because of collinearity.
Collinearity found in xvarlist:  Z2 Z

. assert _rc==498

. 
. * identical covariate placed first: fails with dropcol option
. cap noi pllf, profile(Z) dropcol: logit Y Z2 Z [fw=n]
note: Z omitted because of collinearity.
Collinearity found in xvarlist:  Z2 Z
dropcollinear option --> reduced xvarlist: Z2
Profile variable Z not found in varlist

. assert _rc==198

. 
. * identical covariate placed last: succeeds with dropcol option
. pllf, profile(Z) dropcol: logit Y Z Z2 [fw=n]
note: Z2 omitted because of collinearity.
Collinearity found in xvarlist:  Z Z2
dropcollinear option --> reduced xvarlist: Z
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching......


-------------------------------------------------------------
           Y |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           Z | -1.332227     1.26688    -4.330427    .6356513
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI
Graph command stored as F9

. assert `ref' == r(l_llci)

. 
end of do-file
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_collinear.log
  log type:  text
 closed on:  10 Dec 2025, 16:36:39
----------------------------------------------------------------------------------------------------
