----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_pllf.log
  log type:  text
 opened on:   3 Nov 2025, 20:53:16
version 19.5
c:\ian\git\pllf\pllf.ado
*! v1.3.5 PR 04mar2023 / IW 03nov2025

. /*
> Main test file for pllf
> IW 17mar2025
> Added commands from help file 12may2025
> Revised for the colon command 28may2025
> Added tests of normal() and collinearity handling 1aug2025
> Update for renaming shownormal to normal, 1sep2025
> */
. 
. * from help file
. use ../brcancer, clear
(German breast cancer data)

. 
. * Syntax 1
. 
. stcox x1 x4a x5e x6 hormon, nohr

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1729.3392
Iteration 2:  Log likelihood =  -1724.659
Iteration 3:  Log likelihood = -1724.5759
Iteration 4:  Log likelihood = -1724.5758
Refining estimates:
Iteration 0:  Log likelihood = -1724.5758

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(5)    = 127.19
Log likelihood = -1724.5758                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   .0010071   .0060449     0.17   0.868    -.0108407    .0128548
         x4a |   .6464434   .2466192     2.62   0.009     .1630787    1.129808
         x5e |  -1.994528   .2258596    -8.83   0.000    -2.437204   -1.551851
          x6 |   -.002276   .0005416    -4.20   0.000    -.0033376   -.0012144
      hormon |  -.3821333   .1280919    -2.98   0.003    -.6331889   -.1310778
------------------------------------------------------------------------------

. local b5 = _b[x5e]

. local se5 = _se[x5e]

. pllf, profile(x5e) range(-3 -1) normal: stcox x1 x4a x5e x6 hormon, nohr
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.994528    .2259832    -2.435385   -1.549547
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert `b5' == r(b)

. assert `se5' == r(se)

. assert reldif(r(se),r(pse))<0.001

. 
. stpm x1 x4a x5e x6 hormon, df(2) scale(h) 

Initial:      Log likelihood = -613.04232
Rescale:      Log likelihood = -613.04232
Rescale eq:   Log likelihood = -613.04232
Iteration 0:  Log likelihood = -613.04232  
Iteration 1:  Log likelihood = -612.56333  
Iteration 2:  Log likelihood = -612.56186  
Iteration 3:  Log likelihood = -612.56186  

                                                  Number of obs   =        686
                                                  Wald chi2(5)    =     121.62
Log likelihood = -612.56186                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
s0           |
       _cons |   1.817123   .1132867    16.04   0.000     1.595085    2.039161
-------------+----------------------------------------------------------------
s1           |
       _cons |   .3962196   .0698136     5.68   0.000     .2593874    .5330517
-------------+----------------------------------------------------------------
xb           |
          x1 |   .0013215   .0060384     0.22   0.827    -.0105135    .0131566
         x4a |   .6584541   .2465223     2.67   0.008     .1752793    1.141629
         x5e |   -1.99701   .2254953    -8.86   0.000    -2.438973   -1.555048
          x6 |  -.0022624     .00054    -4.19   0.000    -.0033207    -.001204
      hormon |  -.3800499   .1280752    -2.97   0.003    -.6310726   -.1290271
       _cons |  -12.74299   .8991566   -14.17   0.000    -14.50531   -10.98068
------------------------------------------------------------------------------
Deviance =  1225.124 (686 observations.)

. local b1 = [xb]_b[x1]

. local se1 = [xb]_se[x1]

. pllf, profile(x1) gen(betavar pllvar) normal: stpm x1 x4a x5e x6 hormon, df(2) scale(h) 
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
          x1 |  .0013215    .0060392    -.0105103     .013163
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. confirm var betavar pllvar _pllnorm

. mac l _b1
_b1:            .0013215433224121

. di r(b)
.00132154

. assert reldif(`b1',r(b))<1E-7

. assert reldif(`se1',r(se))<1E-7

. assert reldif(r(se),r(pse))<0.001

. drop betavar pllvar _pllnorm

. 
. * with/without eqname: failed 1/8/2025
. * note it's faster via constraints
. pllf, profile(x5e) n_eval(20): streg x1 x4a x5e x6 hormon, dist(expo)
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.839526    .2212442    -2.270781    -1.40352
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local ulci = r(l_ulci)

. pllf, profile([_t]x5e) n_eval(20): streg x1 x4a x5e x6 hormon, dist(expo)
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[_t]         |
         x5e | -1.839526    .2212442    -2.270781   -1.403519
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif(`ulci', r(l_ulci))<1E-7

. 
. * collinearity
. gen horm2=hormon

. cap noi pllf, profile(x5e) n_eval(20): streg horm2 x1 x4a x5e x6 hormon, distribution(expo)
note: hormon omitted because of collinearity.
Collinearity found in xvarlist: horm2 x1 x4a x5e x6 hormon

. assert _rc==498

. pllf, profile(x5e) n_eval(20) dropcol: streg horm2 x1 x4a x5e x6 hormon, distribution(expo)
note: hormon omitted because of collinearity.
Collinearity found in xvarlist: horm2 x1 x4a x5e x6 hormon
dropcollinear option --> reduced xvarlist: horm2 x1 x4a x5e x6
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.839526    .2212442    -2.270781    -1.40352
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif(`ulci', r(l_ulci))<1E-7

. 
. pllf, profile([ln_p]_cons) n_eval(50): streg x1 x4a x5e x6 hormon, distribution(weibull)
Profiling:..................................................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[ln_p]       |
       _cons |  .3416282    .0483097     .2448839    .4342542
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. pllf, profile([ln_p]x4b) deviance difference n_eval(20): streg x1 x4a x5e x6 hormon, distribution(
> weibull) ancillary(x4b) 
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[ln_p]       |
         x4b |  .0108322    .0134789    -.0162806    .0365557
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * Syntax 2
. pllf, formula(exp(-@*x5)) range(.05 .25): stcox x1 x4a x6 hormon
....................................................................................................
> ...

-------------------------------------------------------------
          _t |      Est.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
 Parameter @ |  .1369005    .0471161     .0694188    .2541106
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local pllf_ll = r(ll)

. mac l _pllf_ll
_pllf_ll:       -1724.494527373777

. gen expXx5 = exp(-r(b)*x5)

. stcox x1 x4a expXx5 x6 hormon

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1728.7511
Iteration 2:  Log likelihood = -1724.5797
Iteration 3:  Log likelihood = -1724.4946
Iteration 4:  Log likelihood = -1724.4945
Refining estimates:
Iteration 0:  Log likelihood = -1724.4945

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(5)    = 127.36
Log likelihood = -1724.4945                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   1.001004   .0060544     0.17   0.868     .9892075    1.012941
         x4a |   1.911051   .4712224     2.63   0.009     1.178651    3.098557
      expXx5 |   .1427484   .0316978    -8.77   0.000     .0923759    .2205888
          x6 |     .99772   .0005401    -4.22   0.000     .9966621    .9987791
      hormon |   .6810263   .0872149    -3.00   0.003     .5298532    .8753306
------------------------------------------------------------------------------

. di e(ll)
-1724.4945

. assert abs(e(ll)-`pllf_ll')<1E-3

. pllf, formula(exp(-#*x5)) placeholder(#) range(.05 .25): stcox x1 x4a x6 hormon
....................................................................................................
> ...

-------------------------------------------------------------
          _t |      Est.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
 Parameter # |  .1369005    .0471161     .0694188    .2541106
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. di r(ll)
-1724.4945

. assert abs(r(ll)-`pllf_ll')<1E-3

. 
. 
. * Syntax 1 again
. sysuse auto, clear
(1978 automobile data)

. gen one = 1

. pllf, profile(one): reg mpg foreign rep78 one, noconstant 
Warning: pllf is a likelihood-based method and will ignore variance-covariance method ols
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
         mpg |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         one |  15.85898    2.490363     10.88681    20.83115
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. pllf, profile(_cons): reg mpg foreign rep78
Warning: pllf is a likelihood-based method and will ignore variance-covariance method ols
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
         mpg |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       _cons |  15.85898    2.490363     10.88681    20.83115
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif( `asym', r(asym)) < 1E-7

. 
. 
. * perfect prediction
. clear

. input z d n

             z          d          n
  1. 0 0 38
  2. 0 1 4
  3. 1 0 36
  4. 1 1 0
  5. end

. tab d z [fw=n], chi2

           |           z
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |        38         36 |        74 
         1 |         4          0 |         4 
-----------+----------------------+----------
     Total |        42         36 |        78 

          Pearson chi2(1) =   3.6139   Pr = 0.057

. pllf, profile(z) range(-5 0) gropt(name(perfpred,replace)):  logit d z [fw=n]
Warning: after MLE, _se[z] is zero
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching..................................................
[note: failed to find lower confidence limit]


-------------------------------------------------------------
           d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z |         .           .            .   -.3892172
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. 
. * blogit and glm
. clear

. input z n d

             z          n          d
  1. 0 100 38
  2. 1 100 28
  3. end

. 
. blogit d n i.z

Logistic regression for grouped data                    Number of obs =    200
                                                        LR chi2(1)    =   2.27
                                                        Prob > chi2   = 0.1321
Log likelihood = -125.70174                             Pseudo R2     = 0.0089

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         1.z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

. pllf, profile(z) debug gropt(name(blogit,replace)) normal(lcol(red)): blogit d n z
Debug: coefficient is z
Finding MLE using: blogit d n z ,   

Logistic regression for grouped data                    Number of obs =    200
                                                        LR chi2(1)    =   2.27
                                                        Prob > chi2   = 0.1321
Log likelihood = -125.70174                             Pseudo R2     = 0.0089

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

Profiling: using offset.............................................................................
> .......................

Drawing graph: graph twoway (line _pll _beta) (line _pllnorm _beta, lpattern(dash) lcol(red)), ytitl
> e(profile log likelihood) name(blogit,replace) title("Asymmetry = -0.8%") xline(-1.055610821517764
>  .1366534276068565, lstyle(ci) ) yline(-127.6224738115053, lstyle(refline) )

-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z | -.4549134    .3041546    -1.055611    .1366534
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. * understands blogit has 2 "yvars"
. 
. glm d z, family(binomial n) 

Iteration 0:  Log likelihood = -4.9255063  
Iteration 1:  Log likelihood = -4.9255063  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          0
                                                  Scale parameter =          1
Deviance         =  1.64309e-14                   (1/df) Deviance =          .
Pearson          =  4.03166e-19                   (1/df) Pearson  =          .

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.925506
Log likelihood   = -4.925506276                   BIC             =   1.64e-14

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

. pllf, profile(z) debug: glm d z, family(binomial n)
Debug: coefficient is z
Finding MLE using: glm d z , family(binomial n)  

Iteration 0:  Log likelihood = -4.9255063  
Iteration 1:  Log likelihood = -4.9255063  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          0
                                                  Scale parameter =          1
Deviance         =  1.64309e-14                   (1/df) Deviance =          .
Pearson          =  4.03166e-19                   (1/df) Pearson  =          .

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.925506
Log likelihood   = -4.925506276                   BIC             =   1.64e-14

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

Profiling: using offset.............................................................................
> .......................

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -0.8%") xline(-1.055610821517805
>  .1366534276068393, lstyle(ci) ) yline(-6.846235686798055, lstyle(refline) )

-------------------------------------------------------------
           d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z | -.4549134    .3041546    -1.055611    .1366534
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * poisson with exposure()
. clear

. input group pyears events

         group     pyears     events
  1. 0 200 38
  2. 1 100 19
  3. end

. poisson events group, exposure(pyears)

Iteration 0:  Log likelihood = -5.1354684  
Iteration 1:  Log likelihood = -5.1354681  

Poisson regression                                     Number of obs =       2
                                                       LR chi2(1)    =   -0.00
                                                       Prob > chi2   =  1.0000
Log likelihood = -5.1354681                            Pseudo R2     = -0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   1.10e-08   .2809757     0.00   1.000    -.5507023    .5507023
       _cons |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

. pllf, profile(group): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       group |  1.10e-08    .2828049    -.5712639    .5373108
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. pllf, profile(group) range(-1 1): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       group |  1.10e-08    .2827977     -.571238    .5373086
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. di r(asym)
-3.0607063

. pllf, profile([events]group) range(-1 1): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[events]     |
       group |  1.10e-08    .2827977    -.5712379    .5373087
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. di r(asym)
-3.0606888

. assert reldif( `asym', r(asym)) < 1E-4 // fails at 1E-7

. 
. * profile the constant: two ways
. pllf, trace n_eval(10) debug profile(_cons): poisson events group, exposure(pyears)
Debug: coefficient is _cons
Finding MLE using: poisson events group , exposure(pyears)

Iteration 0:  Log likelihood = -5.1354684  
Iteration 1:  Log likelihood = -5.1354681  

Poisson regression                                     Number of obs =       2
                                                       LR chi2(1)    =   -0.00
                                                       Prob > chi2   =  1.0000
Log likelihood = -5.1354681                            Pseudo R2     = -0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   1.10e-08   .2809757     0.00   1.000    -.5507023    .5507023
       _cons |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

Profiling: using offset:
_cons=-2.042269   PLL=-7.5807054
_cons=-1.9574828  PLL=-6.6547154
_cons=-1.8726966  PLL=-5.9318752
_cons=-1.7879105  PLL=-5.4301603
_cons=-1.7031243  PLL=-5.1691369
_cons=-1.6183381  PLL=-5.1701022
_cons=-1.5335519  PLL=-5.4562384
_cons=-1.4487658  PLL=-6.0527784
_cons=-1.3639796  PLL=-6.9871881
_cons=-1.2791934  PLL=-8.2893638

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -5.1%") xline(-1.994243617473411
>  -1.359486293743898, lstyle(ci) ) yline(-7.056197538295342, lstyle(refline) )

-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       _cons | -1.660731    .1619309    -1.994244   -1.359486
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. gen one=1

. pllf, trace n_eval(10) debug profile(one): poisson events group one, exposure(pyears) nocons
Debug: coefficient is one
Finding MLE using: poisson events group one , noconstant exposure(pyears)

Iteration 0:  Log likelihood = -84.716151  
Iteration 1:  Log likelihood = -5.2554669  
Iteration 2:  Log likelihood = -5.1356577  
Iteration 3:  Log likelihood = -5.1354681  
Iteration 4:  Log likelihood = -5.1354681  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(2)  = 157.21
Log likelihood = -5.1354681                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   3.44e-11   .2809757     0.00   1.000    -.5507023    .5507023
         one |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

Profiling: using offset:
one=-2.042269   PLL=-7.5807054
one=-1.9574828  PLL=-6.6547154
one=-1.8726966  PLL=-5.9318752
one=-1.7879105  PLL=-5.4301603
one=-1.7031243  PLL=-5.1691369
one=-1.6183381  PLL=-5.1701022
one=-1.5335519  PLL=-5.4562384
one=-1.4487658  PLL=-6.0527784
one=-1.3639796  PLL=-6.9871881
one=-1.2791934  PLL=-8.2893638

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -5.1%") xline(-1.99424361745443 
> -1.359486293742123, lstyle(ci) ) yline(-7.056197538295324, lstyle(refline) )

-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         one | -1.660731    .1619309    -1.994244   -1.359486
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif( `asym', r(asym)) < 1E-7

. 
. 
. * TRISST data, MRI vs CT comparison
. * NB it's a NI trial so don't get excited about the profile CI not crossing the null 
. *       NI margin is +0.057
. use ../TRISST, clear
(NI trial of MRI vs CT after testicular cancer. Margin: RD = +0.057. Joffe 2022.)

. pllf, norm verbose profile(modality): binreg outcome modality [fw=n], rd
Finding MLE using: binreg outcome modality [fweight= n], rd  

Iteration 1:  Deviance =  100.0224
Iteration 2:  Deviance =  100.0224

Generalized linear models                         Number of obs   =        669
Optimization     : MQL Fisher scoring             Residual df     =        667
                   (IRLS EIM)                     Scale parameter =          1
Deviance         =  100.0224151                   (1/df) Deviance =   .1499586
Pearson          =          669                   (1/df) Pearson  =   1.002999

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = u                       [Identity]

                                                  BIC             =  -4239.336

------------------------------------------------------------------------------
             |                 EIM
     outcome | Risk diff.   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    modality |  -.0178926    .009349    -1.91   0.056    -.0362163    .0004311
       _cons |   .0238806   .0083416     2.86   0.004     .0075313    .0402299
------------------------------------------------------------------------------
note: valid log likelihood not returned in e(ll);
if available, trying e(deviance) instead
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~* |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0099405    -.0390899   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * TEST HANDLING INTERACTIONS
. use ../brcancer, clear
(German breast cancer data)

. stcox x2##x4a x5e x6 hormon, nohr

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1728.5778
Iteration 2:  Log likelihood = -1723.7992
Iteration 3:  Log likelihood = -1723.7108
Iteration 4:  Log likelihood = -1723.7107
Refining estimates:
Iteration 0:  Log likelihood = -1723.7107

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(6)    = 128.92
Log likelihood = -1723.7107                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        2.x2 |   .5870545   .5007135     1.17   0.241     -.394326    1.568435
       1.x4a |   .9569604   .4215206     2.27   0.023     .1307952    1.783126
             |
      x2#x4a |
        2 1  |  -.5167128   .5151116    -1.00   0.316    -1.526313    .4928874
             |
         x5e |  -1.992496   .2260915    -8.81   0.000    -2.435628   -1.549365
          x6 |  -.0022597   .0005388    -4.19   0.000    -.0033157   -.0012037
      hormon |  -.3985667   .1279471    -3.12   0.002    -.6493383   -.1477951
------------------------------------------------------------------------------

. 
. * we can't profile the interaction parameter using new factor variables,
. * but we can using xi
. 
. * the easy way
. xi i.x2*i.x4a
i.x2              _Ix2_1-2            (naturally coded; _Ix2_1 omitted)
i.x4a             _Ix4a_0-1           (naturally coded; _Ix4a_0 omitted)
i.x2*i.x4a        _Ix2Xx4a_#_#        (coded as above)

. pllf, profile(_Ix2Xx4a_2_1) normal n_eval(20): stcox _I* x5e x6 hormon, nohr
Profiling:....................


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
_Ix2Xx4a_2_1 | -.5167128    .5245353     -1.59685    .4592907
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * the one-step way
. xi: pllf, profile(_Ix2Xx4a_2_1) normal n_eval(20): stcox i.x2*i.x4a x5e x6 hormon
i.x2              _Ix2_1-2            (naturally coded; _Ix2_1 omitted)
i.x4a             _Ix4a_0-1           (naturally coded; _Ix4a_0 omitted)
i.x2*i.x4a        _Ix2Xx4a_#_#        (coded as above)
Profiling:....................


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
_Ix2Xx4a_2_1 | -.5167128    .5245353     -1.59685    .4592907
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
end of do-file
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_pllf.log
  log type:  text
 closed on:   3 Nov 2025, 20:54:29
----------------------------------------------------------------------------------------------------
