----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_pllf.log
  log type:  text
 opened on:   4 Dec 2025, 17:06:47
version 19.5
c:\ian\git\pllf\pllf.ado
*! v1.3.9 PR 04mar2023 / IW 03dec2025

. /*
> Main test file for pllf
> IW 17mar2025
> Added commands from help file 12may2025
> Revised for the colon command 28may2025
> Added tests of normal() and collinearity handling 1aug2025
> Update for renaming shownormal to normal, 1sep2025
> */
. 
. * from help file
. use ../brcancer, clear
(German breast cancer data)

. 
. * Syntax 1
. 
. stcox x1 x4a x5e x6 hormon, nohr

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1729.3392
Iteration 2:  Log likelihood =  -1724.659
Iteration 3:  Log likelihood = -1724.5759
Iteration 4:  Log likelihood = -1724.5758
Refining estimates:
Iteration 0:  Log likelihood = -1724.5758

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(5)    = 127.19
Log likelihood = -1724.5758                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   .0010071   .0060449     0.17   0.868    -.0108407    .0128548
         x4a |   .6464434   .2466192     2.62   0.009     .1630787    1.129808
         x5e |  -1.994528   .2258596    -8.83   0.000    -2.437204   -1.551851
          x6 |   -.002276   .0005416    -4.20   0.000    -.0033376   -.0012144
      hormon |  -.3821333   .1280919    -2.98   0.003    -.6331889   -.1310778
------------------------------------------------------------------------------

. local b5 = _b[x5e]

. local se5 = _se[x5e]

. pllf, profile(x5e) range(-3 -1) normal: stcox x1 x4a x5e x6 hormon, nohr
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.994528    .2259832    -2.435385   -1.549547
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert `b5' == r(b)

. assert `se5' == r(se)

. assert reldif(r(se),r(pse))<0.001

. 
. stpm x1 x4a x5e x6 hormon, df(2) scale(h) 

Initial:      Log likelihood = -613.04232
Rescale:      Log likelihood = -613.04232
Rescale eq:   Log likelihood = -613.04232
Iteration 0:  Log likelihood = -613.04232  
Iteration 1:  Log likelihood = -612.56333  
Iteration 2:  Log likelihood = -612.56186  
Iteration 3:  Log likelihood = -612.56186  

                                                  Number of obs   =        686
                                                  Wald chi2(5)    =     121.62
Log likelihood = -612.56186                       Prob > chi2     =     0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
s0           |
       _cons |   1.817123   .1132867    16.04   0.000     1.595085    2.039161
-------------+----------------------------------------------------------------
s1           |
       _cons |   .3962196   .0698136     5.68   0.000     .2593874    .5330517
-------------+----------------------------------------------------------------
xb           |
          x1 |   .0013215   .0060384     0.22   0.827    -.0105135    .0131566
         x4a |   .6584541   .2465223     2.67   0.008     .1752793    1.141629
         x5e |   -1.99701   .2254953    -8.86   0.000    -2.438973   -1.555048
          x6 |  -.0022624     .00054    -4.19   0.000    -.0033207    -.001204
      hormon |  -.3800499   .1280752    -2.97   0.003    -.6310726   -.1290271
       _cons |  -12.74299   .8991566   -14.17   0.000    -14.50531   -10.98068
------------------------------------------------------------------------------
Deviance =  1225.124 (686 observations.)

. local b1 = [xb]_b[x1]

. local se1 = [xb]_se[x1]

. pllf, profile(x1) gen(betavar pllvar) normal: stpm x1 x4a x5e x6 hormon, df(2) scale(h) 
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
          x1 |  .0013215    .0060392    -.0105103     .013163
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. confirm var betavar pllvar _pllnorm

. mac l _b1
_b1:            .0013215433224139

. di r(b)
.00132154

. assert reldif(`b1',r(b))<1E-7

. assert reldif(`se1',r(se))<1E-7

. assert reldif(r(se),r(pse))<0.001

. drop betavar pllvar _pllnorm

. 
. * with/without eqname: failed 1/8/2025
. * note it's faster via constraints
. pllf, profile(x5e) n_eval(20): streg x1 x4a x5e x6 hormon, dist(expo)
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.839526    .2212442    -2.270781    -1.40352
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local ulci = r(l_ulci)

. pllf, profile([_t]x5e) n_eval(20): streg x1 x4a x5e x6 hormon, dist(expo)
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[_t]         |
         x5e | -1.839526    .2212442    -2.270781   -1.403519
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif(`ulci', r(l_ulci))<1E-7

. 
. * collinearity
. gen horm2=hormon

. cap noi pllf, profile(x5e) n_eval(20): streg horm2 x1 x4a x5e x6 hormon, distribution(expo)
note: hormon omitted because of collinearity.
Collinearity found in xvarlist: horm2 x1 x4a x5e x6 hormon

. assert _rc==498

. pllf, profile(x5e) n_eval(20) dropcol: streg horm2 x1 x4a x5e x6 hormon, distribution(expo)
note: hormon omitted because of collinearity.
Collinearity found in xvarlist: horm2 x1 x4a x5e x6 hormon
dropcollinear option --> reduced xvarlist: horm2 x1 x4a x5e x6
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         x5e | -1.839526    .2212442    -2.270781    -1.40352
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif(`ulci', r(l_ulci))<1E-7

. 
. pllf, profile([ln_p]_cons) n_eval(50): streg x1 x4a x5e x6 hormon, distribution(weibull)
Profiling:..................................................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[ln_p]       |
       _cons |  .3416282    .0483097     .2448839    .4342542
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. pllf, profile([ln_p]x4b) deviance difference n_eval(20): streg x1 x4a x5e x6 hormon, distribution(
> weibull) ancillary(x4b) 
Profiling:....................


-------------------------------------------------------------
          _t |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[ln_p]       |
         x4b |  .0108322    .0134789    -.0162806    .0365557
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * Syntax 2
. pllf, formula(exp(-@*x5)) range(.05 .25): stcox x1 x4a x6 hormon
....................................................................................................
> ...

-------------------------------------------------------------
          _t |      Est.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
 Parameter @ |  .1369005    .0471161     .0694188    .2541106
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local pllf_ll = r(ll)

. mac l _pllf_ll
_pllf_ll:       -1724.494527373777

. gen expXx5 = exp(-r(b)*x5)

. stcox x1 x4a expXx5 x6 hormon

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1728.7511
Iteration 2:  Log likelihood = -1724.5797
Iteration 3:  Log likelihood = -1724.4946
Iteration 4:  Log likelihood = -1724.4945
Refining estimates:
Iteration 0:  Log likelihood = -1724.4945

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(5)    = 127.36
Log likelihood = -1724.4945                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Haz. ratio   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
          x1 |   1.001004   .0060544     0.17   0.868     .9892075    1.012941
         x4a |   1.911051   .4712224     2.63   0.009     1.178651    3.098557
      expXx5 |   .1427484   .0316978    -8.77   0.000     .0923759    .2205888
          x6 |     .99772   .0005401    -4.22   0.000     .9966621    .9987791
      hormon |   .6810263   .0872149    -3.00   0.003     .5298532    .8753306
------------------------------------------------------------------------------

. di e(ll)
-1724.4945

. assert abs(e(ll)-`pllf_ll')<1E-3

. pllf, formula(exp(-#*x5)) placeholder(#) range(.05 .25): stcox x1 x4a x6 hormon
....................................................................................................
> ...

-------------------------------------------------------------
          _t |      Est.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
 Parameter # |  .1369005    .0471161     .0694188    .2541106
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. di r(ll)
-1724.4945

. assert abs(r(ll)-`pllf_ll')<1E-3

. 
. * and the case where we need to differentiate
. pllf, trace formula(exp(-@*x5/100)) n(5) range(-20 20): stcox x1 x5 x4a x6 hormon
replacing with first (numerical) derivative
replacing with second (numerical) derivative
Parameter @=-20         PLL=-1725.3203
Parameter @=-10         PLL=-1724.3581
replacing with first (numerical) derivative
replacing with second (numerical) derivative
Parameter @=0           PLL=-1723.34
Parameter @=10          PLL=-1723.8033
Parameter @=20          PLL=-1725.1526

-------------------------------------------------------------
          _t |      Est.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
 Parameter @ |  1.872593    10.12296    -19.11088    20.57039
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * Syntax 1 again
. sysuse auto, clear
(1978 automobile data)

. gen one = 1

. pllf, profile(one): reg mpg foreign rep78 one, noconstant 
Warning: pllf is a likelihood-based method and will ignore variance-covariance method ols
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
         mpg |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         one |  15.85898    2.490363     10.88681    20.83115
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. pllf, profile(_cons): reg mpg foreign rep78
Warning: pllf is a likelihood-based method and will ignore variance-covariance method ols
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
         mpg |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       _cons |  15.85898    2.490363     10.88681    20.83115
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif( `asym', r(asym)) < 1E-7

. 
. 
. * perfect prediction
. clear

. input z d n

             z          d          n
  1. 0 0 38
  2. 0 1 4
  3. 1 0 36
  4. 1 1 0
  5. end

. tab d z [fw=n], chi2

           |           z
         d |         0          1 |     Total
-----------+----------------------+----------
         0 |        38         36 |        74 
         1 |         4          0 |         4 
-----------+----------------------+----------
     Total |        42         36 |        78 

          Pearson chi2(1) =   3.6139   Pr = 0.057

. pllf, profile(z) range(-5 0) gropt(name(perfpred,replace)):  logit d z [fw=n]
Warning: after MLE, _se[z] is zero
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching..................................................
[note: failed to find lower confidence limit]


-------------------------------------------------------------
           d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z |         .           .            .   -.3892172
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. pllf, profile(z) range(-5 0) eform: logit d z [fw=n]
Warning: after MLE, _se[z] is zero
Profiling:..........................................................................................
> ..........
Lower confidence limit not yet found: searching..................................................
[note: failed to find lower confidence limit]


-------------------------------------------------------------
           d |exp(parmname)   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z |         .           .            .    .6775871
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * blogit and glm
. clear

. input z n d

             z          n          d
  1. 0 100 38
  2. 1 100 28
  3. end

. 
. blogit d n i.z

Logistic regression for grouped data                    Number of obs =    200
                                                        LR chi2(1)    =   2.27
                                                        Prob > chi2   = 0.1321
Log likelihood = -125.70174                             Pseudo R2     = 0.0089

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         1.z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

. pllf, profile(z) debug gropt(name(blogit,replace)) normal(lcol(red)): blogit d n z
Debug: parameter is z
Finding MLE using: blogit d n z ,    

Logistic regression for grouped data                    Number of obs =    200
                                                        LR chi2(1)    =   2.27
                                                        Prob > chi2   = 0.1321
Log likelihood = -125.70174                             Pseudo R2     = 0.0089

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

Profiling: using offset

Parm: z = -1.168483257999263
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.39862                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.1830127   .1559339    -1.17   0.241    -.4886376    .1226122
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.154067704977397
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.29243                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.1887479   .1558008    -1.21   0.226    -.4941119     .116616
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.139652151955531
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.18829                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.1945026   .1556692    -1.25   0.211    -.4996086    .1106033
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.125236598933666
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.08621                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2002767    .155539    -1.29   0.198    -.5051275    .1045742
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.1108210459118
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.98619                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2060701   .1554104    -1.33   0.185    -.5106689    .0985287
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.096405492889934
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.88825                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2118828   .1552833    -1.36   0.172    -.5162324    .0924668
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.081989939868068
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.79237                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2177148   .1551577    -1.40   0.161    -.5218182    .0863887
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.067574386846202
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.69858                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.223566   .1550336    -1.44   0.149    -.5274262    .0802943
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.053158833824337
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.60688                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2294363   .1549111    -1.48   0.139    -.5330564    .0741838
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.038743280802471
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.51726                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2353259   .1547901    -1.52   0.128    -.5387088    .0680571
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.024327727780605
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.42974                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2412345   .1546706    -1.56   0.119    -.5443833    .0619143
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.009912174758739
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.34433                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2471623   .1545527    -1.60   0.110      -.55008    .0557554
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9954966217368734
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.26102                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.253109   .1544363    -1.64   0.101    -.5557987    .0495806
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9810810687150076
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.17982                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2590748   .1543215    -1.68   0.093    -.5615395    .0433898
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9666655156931419
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.10075                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2650596   .1542083    -1.72   0.086    -.5673023    .0371832
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.952249962671276
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.02379                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2710632   .1540966    -1.76   0.079    -.5730871    .0309606
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9378344096494102
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.94896                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2770858   .1539866    -1.80   0.072    -.5788939    .0247223
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9234188566275444
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.87627                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2831272    .153878    -1.84   0.066    -.5847227    .0184682
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9090033036056786
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.80571                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2891875   .1537711    -1.88   0.060    -.5905734    .0121983
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8945877505838128
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.73729                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2952666   .1536658    -1.92   0.055     -.596446    .0059128
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.880172197561947
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.67103                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3013644    .153562    -1.96   0.050    -.6023405   -.0003883
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8657566445400813
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.60691                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.307481   .1534599    -2.00   0.045    -.6082568   -.0067051
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8513410915182154
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.54495                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3136162   .1533594    -2.04   0.041     -.614195   -.0130374
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8369255384963497
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.48515                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3197701   .1532604    -2.09   0.037     -.620155   -.0193851
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8225099854744837
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.42752                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3259426   .1531631    -2.13   0.033    -.6261368   -.0257484
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.808094432452618
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.37205                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3321338   .1530674    -2.17   0.030    -.6321404   -.0321271
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7936788794307522
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.31876                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3383435   .1529733    -2.21   0.027    -.6381657   -.0385212
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7792633264088864
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.26765                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3445717   .1528809    -2.25   0.024    -.6442127   -.0449307
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7648477733870206
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.21872                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3508185   .1527901    -2.30   0.022    -.6502815   -.0513554
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7504322203651548
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.17198                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3570837   .1527009    -2.34   0.019    -.6563719   -.0577955
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7360166673432891
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.12743                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3633673   .1526133    -2.38   0.017    -.6624839   -.0642507
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7216011143214232
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.08507                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3696694   .1525274    -2.42   0.015    -.6686176   -.0707212
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7071855612995575
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.04491                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3759899   .1524431    -2.47   0.014    -.6747729   -.0772069
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6927700082776915
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.00696                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3823288   .1523605    -2.51   0.012    -.6809498   -.0837077
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6783544552558258
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.97121                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3886859   .1522795    -2.55   0.011    -.6871483   -.0902236
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.66393890223396
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.93767                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3950614   .1522002    -2.60   0.009    -.6933683   -.0967546
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6495233492120942
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.90634                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4014552   .1521225    -2.64   0.008    -.6996098   -.1033005
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6351077961902284
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.87723                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4078672   .1520465    -2.68   0.007    -.7058729   -.1098615
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6206922431683626
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.85034                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4142975   .1519722    -2.73   0.006    -.7121575   -.1164375
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6062766901464968
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.82567                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4207459   .1518995    -2.77   0.006    -.7184635   -.1230284
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.591861137124631
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.80324                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4272126   .1518285    -2.81   0.005     -.724791   -.1296342
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5774455841027651
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.78303                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4336974   .1517591    -2.86   0.004    -.7311399    -.136255
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5630300310808994
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.76505                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4402004   .1516915    -2.90   0.004    -.7375102   -.1428905
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5486144780590336
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.74932                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4467214   .1516255    -2.95   0.003    -.7439019   -.1495409
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5341989250371678
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.73582                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4532605   .1515612    -2.99   0.003     -.750315   -.1562061
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.519783372015302
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.72456                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4598177   .1514986    -3.04   0.002    -.7567495    -.162886
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5053678189934362
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.71555                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.466393   .1514376    -3.08   0.002    -.7632053   -.1695807
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4909522659715704
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70879                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4729863   .1513784    -3.12   0.002    -.7696825   -.1762901
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4765367129497046
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70428                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4795976   .1513208    -3.17   0.002    -.7761809   -.1830142
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4621211599278388
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70203                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4862268    .151265    -3.21   0.001    -.7827007    -.189753
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4477056069059729
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70203                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4928741   .1512108    -3.26   0.001    -.7892418   -.1965064
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4332900538841072
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70429                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4995393   .1511583    -3.30   0.001    -.7958041   -.2032745
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4188745008622414
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.70881                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5062224   .1511075    -3.35   0.001    -.8023877   -.2100571
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4044589478403756
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.71559                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5129235   .1510584    -3.40   0.001    -.8089925   -.2168544
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3900433948185098
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.72464                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5196424   .1510111    -3.44   0.001    -.8156186   -.2236661
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.375627841796644
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.73596                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5263792   .1509654    -3.49   0.000    -.8222659   -.2304925
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3612122887747782
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.74954                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5331339   .1509214    -3.53   0.000    -.8289344   -.2373334
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3467967357529124
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.76541                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5399064   .1508792    -3.58   0.000    -.8356241   -.2441887
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3323811827310466
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.78354                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5466968   .1508386    -3.62   0.000     -.842335   -.2510586
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3179656297091807
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.80395                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.553505   .1507998    -3.67   0.000    -.8490671   -.2579429
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.303550076687315
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.82664                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.560331   .1507626    -3.72   0.000    -.8558203   -.2648417
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2891345236654492
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.85161                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5671748   .1507272    -3.76   0.000    -.8625947   -.2717549
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2747189706435834
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.87885                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5740364   .1506935    -3.81   0.000    -.8693902   -.2786825
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2603034176217176
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.90839                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5809157   .1506615    -3.86   0.000    -.8762069   -.2856246
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2458878645998518
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.9402                                 Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5878128   .1506313    -3.90   0.000    -.8830447    -.292581
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.231472311577986
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -125.9743                                 Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5947277   .1506027    -3.95   0.000    -.8899036   -.2995518
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2170567585561202
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.01069                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6016603   .1505759    -4.00   0.000    -.8967836    -.306537
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2026412055342544
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.04937                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6086106   .1505508    -4.04   0.000    -.9036847   -.3135366
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1882256525123885
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.09033                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6155787   .1505274    -4.09   0.000    -.9106069   -.3205505
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1738100994905228
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.13359                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6225645   .1505057    -4.14   0.000    -.9175502   -.3275787
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.159394546468657
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.17914                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6295679   .1504857    -4.18   0.000    -.9245146   -.3346213
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1449789934467911
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.22698                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6365891   .1504675    -4.23   0.000       -.9315   -.3416782
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1305634404249254
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.27711                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6436279    .150451    -4.28   0.000    -.9385065   -.3487493
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1161478874030595
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.32954                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6506845   .1504362    -4.33   0.000    -.9455341   -.3558349
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1017323343811938
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.38426                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6577588   .1504232    -4.37   0.000    -.9525828   -.3629347
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0873167813593281
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.44128                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6648507   .1504119    -4.42   0.000    -.9596526   -.3700489
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0729012283374622
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.5006                                 Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6719603   .1504023    -4.47   0.000    -.9667434   -.3771773
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0584856753155965
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.56221                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6790876   .1503944    -4.52   0.000    -.9738552     -.38432
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0440701222937305
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.62611                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6862325   .1503883    -4.56   0.000    -.9809881    -.391477
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0296545692718648
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.69232                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6933951   .1503838    -4.61   0.000    -.9881421   -.3986482
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0152390162499989
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.76082                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7005754   .1503812    -4.66   0.000    -.9953171   -.4058338
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0008234632281332
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.83161                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7077733   .1503802    -4.71   0.000    -1.002513   -.4130336
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0135920897937327
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.90471                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.714989    .150381    -4.75   0.000     -1.00973   -.4202477
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0280076428155984
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -126.9801                                 Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7222222   .1503835    -4.80   0.000    -1.016968   -.4274761
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0424231958374641
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.05779                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7294731   .1503877    -4.85   0.000    -1.024228   -.4347187
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .05683874885933
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.13778                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7367417   .1503936    -4.90   0.000    -1.031508   -.4419757
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0712543018811957
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.22006                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.744028   .1504013    -4.95   0.000    -1.038809   -.4492469
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0856698549030617
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.30464                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7513319   .1504107    -5.00   0.000    -1.046131   -.4565324
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1000854079249274
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.39152                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7586535   .1504218    -5.04   0.000    -1.053475   -.4638322
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1145009609467933
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.48069                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7659928   .1504347    -5.09   0.000    -1.060839   -.4711463
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .128916513968659
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.57215                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7733497   .1504492    -5.14   0.000    -1.068225   -.4784746
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1433320669905249
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.66591                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7807245   .1504655    -5.19   0.000    -1.075632   -.4858174
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1577476200123906
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.76197                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7881168   .1504836    -5.24   0.000    -1.083059   -.4931744
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1721631730342563
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.86031                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7955269   .1505033    -5.29   0.000    -1.090508   -.5005458
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1865787260561222
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -127.96095                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8029546   .1505248    -5.33   0.000    -1.097978   -.5079314
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2009942790779879
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.06388                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8104001    .150548    -5.38   0.000    -1.105469   -.5153314
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2154098320998539
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.16909                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8178633   .1505729    -5.43   0.000    -1.112981   -.5227458
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2298253851217196
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.2766                                 Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8253442   .1505995    -5.48   0.000    -1.120514   -.5301745
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2442409381435855
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.38639                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8328429   .1506279    -5.53   0.000    -1.128068   -.5376176
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2586564911654512
Command is: blogit d n , offset(__000004)    

Logistic regression for grouped data                       Number of obs = 200
                                                           Wald chi2(0)  =   .
Log likelihood = -128.49847                                Prob > chi2   =   .

------------------------------------------------------------------------------
    _outcome | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8403593    .150658    -5.58   0.000    -1.135643   -.5450751
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Drawing graph: graph twoway (line _pll _beta) (line _pllnorm _beta, lpattern(dash) lcol(red)), ytitl
> e(profile log likelihood) name(blogit,replace) title("Asymmetry = -0.8%") xline(-1.055610821517764
>  .1366534276068565, lstyle(ci) ) yline(-127.6224738115053, lstyle(refline) )

-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z | -.4549134    .3041546    -1.055611    .1366534
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. * understands blogit has 2 "yvars"
. 
. glm d z, family(binomial n) 

Iteration 0:  Log likelihood = -4.9255063  
Iteration 1:  Log likelihood = -4.9255063  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          0
                                                  Scale parameter =          1
Deviance         =  1.64309e-14                   (1/df) Deviance =          .
Pearson          =  4.03166e-19                   (1/df) Pearson  =          .

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.925506
Log likelihood   = -4.925506276                   BIC             =   1.64e-14

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

. pllf, profile(z) debug: glm d z, family(binomial n)
Debug: parameter is z
Finding MLE using: glm d z , family(binomial n)   

Iteration 0:  Log likelihood = -4.9255063  
Iteration 1:  Log likelihood = -4.9255063  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          0
                                                  Scale parameter =          1
Deviance         =  1.64309e-14                   (1/df) Deviance =          .
Pearson          =  4.03166e-19                   (1/df) Pearson  =          .

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.925506
Log likelihood   = -4.925506276                   BIC             =   1.64e-14

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
           z |  -.4549134   .3033941    -1.50   0.134    -1.049555    .1397282
       _cons |  -.4895482   .2060214    -2.38   0.017    -.8933428   -.0857537
------------------------------------------------------------------------------

Profiling: using offset

Parm: z = -1.168483257961754
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.6334151  
Iteration 1:  Log likelihood = -7.6223802  
Iteration 2:  Log likelihood = -7.6223801  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  5.393747555                   (1/df) Deviance =   5.393748
Pearson          =  5.617598717                   (1/df) Pearson  =   5.617599

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    8.62238
Log likelihood   = -7.622380054                   BIC             =     4.7006

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.1830127   .1559339    -1.17   0.241    -.4886376    .1226122
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.154067704939937
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.5263776  
Iteration 1:  Log likelihood = -7.5161902  
Iteration 2:  Log likelihood = -7.5161901  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  5.181367739                   (1/df) Deviance =   5.181368
Pearson          =  5.389488086                   (1/df) Pearson  =   5.389488

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    8.51619
Log likelihood   = -7.516190146                   BIC             =   4.488221

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.188748   .1558008    -1.21   0.226    -.4941119     .116616
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.139652151918121
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.4214407  
Iteration 1:  Log likelihood = -7.4120515  
Iteration 2:  Log likelihood = -7.4120515  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.973090361                   (1/df) Deviance =    4.97309
Pearson          =  5.166317442                   (1/df) Pearson  =   5.166317

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.412051
Log likelihood   = -7.412051457                   BIC             =   4.279943

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.1945027   .1556692    -1.25   0.211    -.4996086    .1106033
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.125236598896304
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.3186102  
Iteration 1:  Log likelihood = -7.3099716  
Iteration 2:  Log likelihood = -7.3099715  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.768930466                   (1/df) Deviance =    4.76893
Pearson          =  4.948071654                   (1/df) Pearson  =   4.948072

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.309972
Log likelihood   = -7.309971509                   BIC             =   4.075783

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2002767    .155539    -1.29   0.198    -.5051276    .1045742
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.110821045874488
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.2178882  
Iteration 1:  Log likelihood = -7.2099544  
Iteration 2:  Log likelihood = -7.2099544  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.568896155                   (1/df) Deviance =   4.568896
Pearson          =  4.734728791                   (1/df) Pearson  =   4.734729

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.209954
Log likelihood   = -7.209954354                   BIC             =   3.875749

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2060701   .1554104    -1.33   0.185    -.5106689    .0985286
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.096405492852671
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.1192801  
Iteration 1:  Log likelihood = -7.1120074  
Iteration 2:  Log likelihood = -7.1120073  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.373002098                   (1/df) Deviance =   4.373002
Pearson          =  4.526274557                   (1/df) Pearson  =   4.526275

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.112007
Log likelihood   = -7.112007326                   BIC             =   3.679855

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2118828   .1552833    -1.36   0.172    -.5162324    .0924668
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.081989939830854
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.0227881  
Iteration 1:  Log likelihood = -7.0161345  
Iteration 2:  Log likelihood = -7.0161344  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.181256298                   (1/df) Deviance =   4.181256
Pearson          =   4.32268817                   (1/df) Pearson  =   4.322688

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.016134
Log likelihood   = -7.016134425                   BIC             =   3.488109

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2177148   .1551577    -1.40   0.161    -.5218183    .0863887
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.067574386809038
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.9284177  
Iteration 1:  Log likelihood = -6.9223428  
Iteration 2:  Log likelihood = -6.9223428  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.993673046                   (1/df) Deviance =   3.993673
Pearson          =  4.123956146                   (1/df) Pearson  =   4.123956

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.922343
Log likelihood   = -6.922342799                   BIC             =   3.300526

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.223566   .1550336    -1.44   0.149    -.5274263    .0802943
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.053158833787221
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.8361716  
Iteration 1:  Log likelihood = -6.8306372  
Iteration 2:  Log likelihood = -6.8306371  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.810261739                   (1/df) Deviance =   3.810262
Pearson          =  3.930060405                   (1/df) Pearson  =    3.93006

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.830637
Log likelihood   = -6.830637146                   BIC             =   3.117115

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2294363   .1549111    -1.48   0.139    -.5330565    .0741838
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.038743280765404
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.7460529  
Iteration 1:  Log likelihood = -6.7410222  
Iteration 2:  Log likelihood = -6.7410222  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.631031788                   (1/df) Deviance =   3.631032
Pearson          =  3.740983498                   (1/df) Pearson  =   3.740983

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.741022
Log likelihood   =  -6.74102217                   BIC             =   2.937885

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2353259   .1547901    -1.52   0.128    -.5387089     .068057
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.024327727743588
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.6580668  
Iteration 1:  Log likelihood = -6.6535048  
Iteration 2:  Log likelihood = -6.6535047  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.455996909                   (1/df) Deviance =   3.455997
Pearson          =  3.556713114                   (1/df) Pearson  =   3.556713

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.653505
Log likelihood   = -6.653504731                   BIC             =    2.76285

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2412345   .1546706    -1.56   0.119    -.5443834    .0619143
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -1.009912174721771
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.5722156  
Iteration 1:  Log likelihood = -6.5680887  
Iteration 2:  Log likelihood = -6.5680887  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.285164838                   (1/df) Deviance =   3.285165
Pearson          =  3.377231221                   (1/df) Pearson  =   3.377231

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.568089
Log likelihood   = -6.568088695                   BIC             =   2.592018

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2471623   .1545527    -1.60   0.110      -.55008    .0557554
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9954966216999547
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.4885042  
Iteration 1:  Log likelihood = -6.4847807  
Iteration 2:  Log likelihood = -6.4847807  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.118548901                   (1/df) Deviance =   3.118549
Pearson          =  3.202526259                   (1/df) Pearson  =   3.202526

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.484781
Log likelihood   = -6.484780727                   BIC             =   2.425402

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.253109   .1544363    -1.64   0.101    -.5557987    .0495806
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9810810686781382
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.4069352  
Iteration 1:  Log likelihood =  -6.403585  
Iteration 2:  Log likelihood =  -6.403585  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.956157383                   (1/df) Deviance =   2.956157
Pearson          =  3.032581949                   (1/df) Pearson  =   3.032582

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.403585
Log likelihood   = -6.403584968                   BIC             =    2.26301

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2590748   .1543215    -1.68   0.093    -.5615395    .0433898
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9666655156563215
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.3275126  
Iteration 1:  Log likelihood = -6.3245069  
Iteration 2:  Log likelihood = -6.3245069  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.798001229                   (1/df) Deviance =   2.798001
Pearson          =  2.867385382                   (1/df) Pearson  =   2.867385

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.324507
Log likelihood   = -6.324506891                   BIC             =   2.104854

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2650596   .1542083    -1.72   0.086    -.5673023    .0371831
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9522499626345049
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.2502399  
Iteration 1:  Log likelihood = -6.2475516  
Iteration 2:  Log likelihood = -6.2475516  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.644090561                   (1/df) Deviance =   2.644091
Pearson          =  2.706923357                   (1/df) Pearson  =   2.706923

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.247552
Log likelihood   = -6.247551557                   BIC             =   1.950943

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2710633   .1540966    -1.76   0.079    -.5730871    .0309606
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9378344096126883
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.1751208  
Iteration 1:  Log likelihood =  -6.172724  
Iteration 2:  Log likelihood =  -6.172724  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   2.49443537                   (1/df) Deviance =   2.494435
Pearson          =  2.551183098                   (1/df) Pearson  =   2.551183

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.172724
Log likelihood   = -6.172723961                   BIC             =   1.801288

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2770858   .1539866    -1.80   0.072    -.5788939    .0247223
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9234188565908716
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.1021589  
Iteration 1:  Log likelihood = -6.1000293  
Iteration 2:  Log likelihood = -6.1000293  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   2.34904611                   (1/df) Deviance =   2.349046
Pearson          =  2.400152876                   (1/df) Pearson  =   2.400153

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.100029
Log likelihood   = -6.100029332                   BIC             =   1.655899

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2831273    .153878    -1.84   0.066    -.5847227    .0184682
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.9090033035690551
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.0313572  
Iteration 1:  Log likelihood = -6.0294719  
Iteration 2:  Log likelihood = -6.0294719  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   2.20793131                   (1/df) Deviance =   2.207931
Pearson          =  2.253819515                   (1/df) Pearson  =    2.25382

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.029472
Log likelihood   = -6.029471931                   BIC             =   1.514784

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2891875   .1537711    -1.88   0.060    -.5905734    .0121983
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8945877505472385
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.9627194  
Iteration 1:  Log likelihood = -5.9610569  
Iteration 2:  Log likelihood = -5.9610569  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.071101178                   (1/df) Deviance =   2.071101
Pearson          =  2.112172141                   (1/df) Pearson  =   2.112172

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.961057
Log likelihood   = -5.961056865                   BIC             =   1.377954

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.2952666   .1536658    -1.92   0.055     -.596446    .0059128
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.880172197525422
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -5.896249  
Iteration 1:  Log likelihood = -5.8947889  
Iteration 2:  Log likelihood = -5.8947889  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   1.93856518                   (1/df) Deviance =   1.938565
Pearson          =  1.975199658                   (1/df) Pearson  =     1.9752

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.894789
Log likelihood   = -5.894788867                   BIC             =   1.245418

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3013644    .153562    -1.96   0.050    -.6023405   -.0003883
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8657566445036053
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.8319493  
Iteration 1:  Log likelihood = -5.8306726  
Iteration 2:  Log likelihood = -5.8306726  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   1.81033265                   (1/df) Deviance =   1.810333
Pearson          =  1.842891377                   (1/df) Pearson  =   1.842891

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.830673
Log likelihood   = -5.830672602                   BIC             =   1.117185

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.307481   .1534599    -2.00   0.045    -.6082569   -.0067051
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8513410914817887
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.7698238  
Iteration 1:  Log likelihood = -5.7687127  
Iteration 2:  Log likelihood = -5.7687127  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.686412786                   (1/df) Deviance =   1.686413
Pearson          =   1.71523701                   (1/df) Pearson  =   1.715237

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.768713
Log likelihood   =  -5.76871267                   BIC             =   .9932656

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3136162   .1533594    -2.04   0.041     -.614195   -.0130374
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8369255384599721
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.7098761  
Iteration 1:  Log likelihood = -5.7089138  
Iteration 2:  Log likelihood = -5.7089138  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.566815137                   (1/df) Deviance =   1.566815
Pearson          =  1.592227169                   (1/df) Pearson  =   1.592227

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.708914
Log likelihood   = -5.708913845                   BIC             =    .873668

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3197701   .1532604    -2.09   0.037     -.620155   -.0193851
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8225099854381555
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.6521089  
Iteration 1:  Log likelihood = -5.6512801  
Iteration 2:  Log likelihood = -5.6512801  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.451547641                   (1/df) Deviance =   1.451548
Pearson          =  1.473851344                   (1/df) Pearson  =   1.473851

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    6.65128
Log likelihood   = -5.651280097                   BIC             =   .7584005

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3259426   .1531631    -2.13   0.033    -.6261368   -.0257484
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.8080944324163388
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.5965258  
Iteration 1:  Log likelihood = -5.5958161  
Iteration 2:  Log likelihood = -5.5958161  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.340619593                   (1/df) Deviance =    1.34062
Pearson          =  1.360100949                   (1/df) Pearson  =   1.360101

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.595816
Log likelihood   = -5.595816073                   BIC             =   .6474724

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3321338   .1530674    -2.17   0.030    -.6321404   -.0321271
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7936788793945223
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =   -5.54313  
Iteration 1:  Log likelihood = -5.5425261  
Iteration 2:  Log likelihood = -5.5425261  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.234039645                   (1/df) Deviance =    1.23404
Pearson          =  1.250967269                   (1/df) Pearson  =   1.250967

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.542526
Log likelihood   = -5.542526099                   BIC             =   .5408925

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3383435   .1529733    -2.21   0.027    -.6381657   -.0385212
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7792633263727057
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.4919248  
Iteration 1:  Log likelihood = -5.4914144  
Iteration 2:  Log likelihood = -5.4914144  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.131816313                   (1/df) Deviance =   1.131816
Pearson          =   1.14644197                   (1/df) Pearson  =   1.146442

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.491414
Log likelihood   = -5.491414433                   BIC             =   .4386691

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3445717   .1528809    -2.25   0.024    -.6442128   -.0449307
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7648477733508892
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.4429134  
Iteration 1:  Log likelihood = -5.4424853  
Iteration 2:  Log likelihood = -5.4424853  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.033957973                   (1/df) Deviance =   1.033958
Pearson          =  1.046517097                   (1/df) Pearson  =   1.046517

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.442485
Log likelihood   = -5.442485263                   BIC             =   .3408108

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3508185   .1527901    -2.30   0.022    -.6502815   -.0513554
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7504322203290725
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -5.396099  
Iteration 1:  Log likelihood = -5.3957427  
Iteration 2:  Log likelihood = -5.3957427  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .9404728604                   (1/df) Deviance =   .9404729
Pearson          =  .9511850724                   (1/df) Pearson  =   .9511851

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.395743
Log likelihood   = -5.395742707                   BIC             =   .2473257

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3570837   .1527009    -2.34   0.019    -.6563719   -.0577955
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7360166673072559
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.3514849  
Iteration 1:  Log likelihood =  -5.351191  
Iteration 2:  Log likelihood =  -5.351191  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .8513694304                   (1/df) Deviance =   .8513694
Pearson          =  .8604390541                   (1/df) Pearson  =   .8604391

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.351191
Log likelihood   = -5.351190992                   BIC             =   .1582222

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3633673   .1526133    -2.38   0.017    -.6624839   -.0642507
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7216011142854393
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.3090738  
Iteration 1:  Log likelihood = -5.3088337  
Iteration 2:  Log likelihood = -5.3088337  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .7666549005                   (1/df) Deviance =   .7666549
Pearson          =  .7742714537                   (1/df) Pearson  =   .7742715

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.308834
Log likelihood   = -5.308833727                   BIC             =   .0735077

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3696694   .1525274    -2.42   0.015    -.6686176   -.0707212
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.7071855612636226
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -5.268869  
Iteration 1:  Log likelihood =  -5.268675  
Iteration 2:  Log likelihood =  -5.268675  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .6863374605                   (1/df) Deviance =   .6863375
Pearson          =  .6926761832                   (1/df) Pearson  =   .6926762

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.268675
Log likelihood   = -5.268675007                   BIC             =  -.0068097

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3759899   .1524431    -2.47   0.014    -.6747729   -.0772069
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6927700082418061
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.2308736  
Iteration 1:  Log likelihood = -5.2307187  
Iteration 2:  Log likelihood = -5.2307187  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .6104247799                   (1/df) Deviance =   .6104248
Pearson          =  .6156471326                   (1/df) Pearson  =   .6156471

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.230719
Log likelihood   = -5.230718666                   BIC             =  -.0827224

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3823288   .1523605    -2.51   0.012    -.6809498   -.0837077
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6783544552199895
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1950905  
Iteration 1:  Log likelihood = -5.1949685  
Iteration 2:  Log likelihood = -5.1949685  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   .538924385                   (1/df) Deviance =   .5389244
Pearson          =  .5431785508                   (1/df) Pearson  =   .5431786

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.194968
Log likelihood   = -5.194968469                   BIC             =  -.1542228

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3886859   .1522795    -2.55   0.011    -.6871483   -.0902236
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6639389021981729
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1615228  
Iteration 1:  Log likelihood = -5.1614281  
Iteration 2:  Log likelihood = -5.1614281  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .4718436579                   (1/df) Deviance =   .4718437
Pearson          =  .4752650435                   (1/df) Pearson  =    .475265

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.161428
Log likelihood   = -5.161428105                   BIC             =  -.2213035

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.3950614   .1522002    -2.60   0.009    -.6933683   -.0967546
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6495233491763563
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1301735  
Iteration 1:  Log likelihood = -5.1301013  
Iteration 2:  Log likelihood = -5.1301013  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .4091900861                   (1/df) Deviance =   .4091901
Pearson          =  .4119018225                   (1/df) Pearson  =   .4119018

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.130101
Log likelihood   = -5.130101319                   BIC             =  -.2839571

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4014552   .1521225    -2.64   0.008    -.6996098   -.1033005
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6351077961545397
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1010454  
Iteration 1:  Log likelihood = -5.1009914  
Iteration 2:  Log likelihood = -5.1009914  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .3509702434                   (1/df) Deviance =   .3509702
Pearson          =  .3530836743                   (1/df) Pearson  =   .3530837

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.100991
Log likelihood   = -5.100991398                   BIC             =  -.3421769

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4078672   .1520465    -2.68   0.007    -.7058729   -.1098615
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6206922431327231
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0741415  
Iteration 1:  Log likelihood = -5.0741019  
Iteration 2:  Log likelihood = -5.0741019  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2971913441                   (1/df) Deviance =   .2971913
Pearson          =  .2988065291                   (1/df) Pearson  =   .2988065

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.074102
Log likelihood   = -5.074101948                   BIC             =  -.3959558

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4142975   .1519722    -2.73   0.006    -.7121575   -.1164375
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.6062766901109065
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0494645  
Iteration 1:  Log likelihood = -5.0494364  
Iteration 2:  Log likelihood = -5.0494364  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2478601875                   (1/df) Deviance =   .2478602
Pearson          =  .2490663914                   (1/df) Pearson  =   .2490664

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.049436
Log likelihood   =  -5.04943637                   BIC             =   -.445287

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4207459   .1518995    -2.77   0.006    -.7184635   -.1230284
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5918611370890899
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0270174  
Iteration 1:  Log likelihood =  -5.026998  
Iteration 2:  Log likelihood =  -5.026998  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2029834258                   (1/df) Deviance =   .2029834
Pearson          =  .2038596097                   (1/df) Pearson  =   .2038596

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.026998
Log likelihood   = -5.026997989                   BIC             =  -.4901638

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4272126   .1518285    -2.81   0.005     -.724791   -.1296342
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5774455840672733
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -5.006803  
Iteration 1:  Log likelihood = -5.0067901  
Iteration 2:  Log likelihood = -5.0067901  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .1625675633                   (1/df) Deviance =   .1625676
Pearson          =  .1631828735                   (1/df) Pearson  =   .1631829

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    6.00679
Log likelihood   = -5.006790058                   BIC             =  -.5305796

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4336974   .1517591    -2.86   0.004    -.7311399    -.136255
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5630300310454567
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -4.988824  
Iteration 1:  Log likelihood = -4.9888158  
Iteration 2:  Log likelihood = -4.9888158  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .1266189556                   (1/df) Deviance =    .126619
Pearson          =  .1270332119                   (1/df) Pearson  =   .1270332

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.988816
Log likelihood   = -4.988815754                   BIC             =  -.5665282

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4402004   .1516915    -2.90   0.004    -.7375102   -.1428905
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5486144780236401
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9730832  
Iteration 1:  Log likelihood = -4.9730782  
Iteration 2:  Log likelihood = -4.9730782  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0951439304                   (1/df) Deviance =   .0951439
Pearson          =  .0954081113                   (1/df) Pearson  =   .0954081

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.973078
Log likelihood   = -4.973078242                   BIC             =  -.5980033

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4467214   .1516255    -2.95   0.003    -.7439019   -.1495409
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5341989250018235
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9595832  
Iteration 1:  Log likelihood = -4.9595804  
Iteration 2:  Log likelihood = -4.9595804  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0681482844                   (1/df) Deviance =   .0681483
Pearson          =   .068305012                   (1/df) Pearson  =    .068305

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    5.95958
Log likelihood   = -4.959580419                   BIC             =  -.6249989

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4532605   .1515612    -2.99   0.003     -.750315   -.1562061
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5197833719800069
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9483267  
Iteration 1:  Log likelihood = -4.9483253  
Iteration 2:  Log likelihood = -4.9483253  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0456380641                   (1/df) Deviance =   .0456381
Pearson          =  .0457220881                   (1/df) Pearson  =   .0457221

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.948325
Log likelihood   = -4.948325308                   BIC             =  -.6475091

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4598177   .1514986    -3.04   0.002    -.7567495    -.162886
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.5053678189581903
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9393164  
Iteration 1:  Log likelihood = -4.9393158  
Iteration 2:  Log likelihood = -4.9393158  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0276190256                   (1/df) Deviance =    .027619
Pearson          =  .0276577053                   (1/df) Pearson  =   .0276577

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.939316
Log likelihood   = -4.939315789                   BIC             =  -.6655282

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.466393   .1514376    -3.08   0.002    -.7632053   -.1695807
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4909522659363736
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9325549  
Iteration 1:  Log likelihood = -4.9325547  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   .014096774                   (1/df) Deviance =   .0140968
Pearson          =   .014110559                   (1/df) Pearson  =   .0141106

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.932555
Log likelihood   = -4.932554663                   BIC             =  -.6790504

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4729863   .1513784    -3.12   0.002    -.7696825   -.1762901
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4765367129145571
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9280447  
Iteration 1:  Log likelihood = -4.9280447  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0050767766                   (1/df) Deviance =   .0050768
Pearson          =   .005079687                   (1/df) Pearson  =   .0050797

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.928045
Log likelihood   = -4.928044665                   BIC             =  -.6880704

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4795976   .1513208    -3.17   0.002    -.7761809   -.1830142
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4621211598927405
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9257884  
Iteration 1:  Log likelihood = -4.9257884  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   .000564297                   (1/df) Deviance =   .0005643
Pearson          =  .0005644023                   (1/df) Pearson  =   .0005644

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.925788
Log likelihood   = -4.925788425                   BIC             =  -.6925829

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4862268    .151265    -3.21   0.001    -.7827007    -.189753
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4477056068709239
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9257885  
Iteration 1:  Log likelihood = -4.9257885  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0005645069                   (1/df) Deviance =   .0005645
Pearson          =  .0005644041                   (1/df) Pearson  =   .0005644

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.925789
Log likelihood   =  -4.92578853                   BIC             =  -.6925827

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4928741   .1512108    -3.26   0.001    -.7892418   -.1965064
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4332900538491073
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9280475  
Iteration 1:  Log likelihood = -4.9280475  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0050823875                   (1/df) Deviance =   .0050824
Pearson          =  .0050796783                   (1/df) Pearson  =   .0050797

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.928047
Log likelihood   =  -4.92804747                   BIC             =  -.6880648

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.4995393   .1511583    -3.30   0.001    -.7958041   -.2032745
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4188745008272907
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9325677  
Iteration 1:  Log likelihood = -4.9325677  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0141227988                   (1/df) Deviance =   .0141228
Pearson          =  .0141105661                   (1/df) Pearson  =   .0141106

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.932568
Log likelihood   = -4.932567676                   BIC             =  -.6790244

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5062224   .1511075    -3.35   0.001    -.8023877   -.2100571
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.4044589478054741
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9393516  
Iteration 1:  Log likelihood = -4.9393515  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0276904236                   (1/df) Deviance =   .0276904
Pearson          =  .0276577074                   (1/df) Pearson  =   .0276577

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.939351
Log likelihood   = -4.939351488                   BIC             =  -.6654568

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5129235   .1510584    -3.40   0.001    -.8089925   -.2168544
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3900433947836575
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9484016  
Iteration 1:  Log likelihood = -4.9484012  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0457897526                   (1/df) Deviance =   .0457898
Pearson          =  .0457220254                   (1/df) Pearson  =    .045722

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.948401
Log likelihood   = -4.948401153                   BIC             =  -.6473574

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5196424   .1510111    -3.44   0.001    -.8156186   -.2236661
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3756278417618409
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9597199  
Iteration 1:  Log likelihood = -4.9597189  
Iteration 2:  Log likelihood = -4.9597189  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0684252385                   (1/df) Deviance =   .0684252
Pearson          =  .0683048799                   (1/df) Pearson  =   .0683049

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.959719
Log likelihood   = -4.959718896                   BIC             =  -.6247219

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5263792   .1509654    -3.49   0.000    -.8222659   -.2304925
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3612122887400243
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9733089  
Iteration 1:  Log likelihood = -4.9733068  
Iteration 2:  Log likelihood = -4.9733068  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .0956010713                   (1/df) Deviance =   .0956011
Pearson          =  .0954078421                   (1/df) Pearson  =   .0954078

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.973307
Log likelihood   = -4.973306812                   BIC             =  -.5975461

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5331339   .1509214    -3.53   0.000    -.8289344   -.2373334
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3467967357182077
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -4.9891709  
Iteration 1:  Log likelihood = -4.9891669  
Iteration 2:  Log likelihood = -4.9891669  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .1273213177                   (1/df) Deviance =   .1273213
Pearson          =  .1270328345                   (1/df) Pearson  =   .1270328

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   5.989167
Log likelihood   = -4.989166935                   BIC             =  -.5658259

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5399064   .1508792    -3.58   0.000    -.8356241   -.2441887
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3323811826963911
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0073079  
Iteration 1:  Log likelihood = -5.0073012  
Iteration 2:  Log likelihood = -5.0073012  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .1635898088                   (1/df) Deviance =   .1635898
Pearson          =  .1631820171                   (1/df) Pearson  =    .163182

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.007301
Log likelihood   = -5.007301181                   BIC             =  -.5295574

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5466968   .1508386    -3.62   0.000     -.842335   -.2510586
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3179656296745745
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0277223  
Iteration 1:  Log likelihood = -5.0277115  
Iteration 2:  Log likelihood = -5.0277115  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2044104488                   (1/df) Deviance =   .2044104
Pearson          =  .2038580967                   (1/df) Pearson  =   .2038581

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.027712
Log likelihood   = -5.027711501                   BIC             =  -.4887367

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.553505   .1507998    -3.67   0.000    -.8490671   -.2579429
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.3035500766527579
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0504162  
Iteration 1:  Log likelihood = -5.0503997  
Iteration 2:  Log likelihood = -5.0503997  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2497867649                   (1/df) Deviance =   .2497868
Pearson          =  .2490638767                   (1/df) Pearson  =   .2490639

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =     6.0504
Log likelihood   = -5.050399659                   BIC             =  -.4433604

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.560331   .1507626    -3.72   0.000    -.8558203   -.2648417
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2891345236309413
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.0753917  
Iteration 1:  Log likelihood = -5.0753673  
Iteration 2:  Log likelihood = -5.0753673  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .2997220895                   (1/df) Deviance =   .2997221
Pearson          =  .2988024393                   (1/df) Pearson  =   .2988024

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.075367
Log likelihood   = -5.075367321                   BIC             =  -.3934251

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5671748   .1507272    -3.76   0.000    -.8625947   -.2717549
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2747189706091246
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1026508  
Iteration 1:  Log likelihood = -5.1026162  
Iteration 2:  Log likelihood = -5.1026162  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .3542199119                   (1/df) Deviance =   .3542199
Pearson          =  .3530774958                   (1/df) Pearson  =   .3530775

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.102616
Log likelihood   = -5.102616232                   BIC             =  -.3389273

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5740364   .1506935    -3.81   0.000    -.8693902   -.2786825
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2603034175873081
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1321957  
Iteration 1:  Log likelihood = -5.1321479  
Iteration 2:  Log likelihood = -5.1321479  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .4132832587                   (1/df) Deviance =   .4132833
Pearson          =  .4118927696                   (1/df) Pearson  =   .4118928

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.132148
Log likelihood   = -5.132147906                   BIC             =  -.2798639

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5809157   .1506615    -3.86   0.000    -.8762069   -.2856246
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2458878645654915
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1640283  
Iteration 1:  Log likelihood = -5.1639638  
Iteration 2:  Log likelihood = -5.1639638  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .4769150287                   (1/df) Deviance =    .476915
Pearson          =  .4752523298                   (1/df) Pearson  =   .4752523

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.163964
Log likelihood   = -5.163963791                   BIC             =  -.2162322

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5878128   .1506313    -3.90   0.000    -.8830447    -.292581
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2314723115436749
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.1981505  
Iteration 1:  Log likelihood = -5.1980653  
Iteration 2:  Log likelihood = -5.1980653  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .5451180895                   (1/df) Deviance =   .5451181
Pearson          =  .5431606877                   (1/df) Pearson  =   .5431607

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.198065
Log likelihood   = -5.198065321                   BIC             =  -.1480291

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.5947277   .1506027    -3.95   0.000    -.8899036   -.2995518
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2170567585218584
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.2345643  
Iteration 1:  Log likelihood = -5.2344539  
Iteration 2:  Log likelihood = -5.2344539  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .6178951688                   (1/df) Deviance =   .6178952
Pearson          =  .6156226887                   (1/df) Pearson  =   .6156227

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.234454
Log likelihood   = -5.234453861                   BIC             =   -.075252

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6016603   .1505759    -4.00   0.000    -.8967836    -.306537
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.2026412055000417
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.2732717  
Iteration 1:  Log likelihood = -5.2731306  
Iteration 2:  Log likelihood = -5.2731306  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .6952486073                   (1/df) Deviance =   .6952486
Pearson          =  .6926432674                   (1/df) Pearson  =   .6926433

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.273131
Log likelihood   =  -5.27313058                   BIC             =   .0021014

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6086106   .1505508    -4.04   0.000    -.9036847   -.3135366
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1882256524782251
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.3142743  
Iteration 1:  Log likelihood = -5.3140967  
Iteration 2:  Log likelihood = -5.3140967  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .7771808102                   (1/df) Deviance =   .7771808
Pearson          =  .7742278966                   (1/df) Pearson  =   .7742279

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.314097
Log likelihood   = -5.314096682                   BIC             =   .0840336

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6155787   .1505274    -4.09   0.000    -.9106069   -.3205505
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1738100994564085
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.3575742  
Iteration 1:  Log likelihood = -5.3573533  
Iteration 2:  Log likelihood = -5.3573533  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .8636940424                   (1/df) Deviance =    .863694
Pearson          =  .8603823845                   (1/df) Pearson  =   .8603824

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.357353
Log likelihood   = -5.357353298                   BIC             =   .1705469

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6225645   .1505057    -4.14   0.000    -.9175502   -.3275787
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1593945464345918
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.4031729  
Iteration 1:  Log likelihood = -5.4029013  
Iteration 2:  Log likelihood = -5.4029013  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  .9547901384                   (1/df) Deviance =   .9547901
Pearson          =  .9511125868                   (1/df) Pearson  =   .9511126

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.402901
Log likelihood   = -5.402901346                   BIC             =    .261643

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6295679   .1504857    -4.18   0.000    -.9245146   -.3346213
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1449789934127752
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.4510723  
Iteration 1:  Log likelihood = -5.4507418  
Iteration 2:  Log likelihood = -5.4507418  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.050471039                   (1/df) Deviance =   1.050471
Pearson          =  1.046424941                   (1/df) Pearson  =   1.046425

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.450742
Log likelihood   = -5.450741796                   BIC             =   .3573239

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6365891   .1504675    -4.23   0.000       -.9315   -.3416782
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1305634403909588
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.5012741  
Iteration 1:  Log likelihood = -5.5008755  
Iteration 2:  Log likelihood = -5.5008755  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.150738545                   (1/df) Deviance =   1.150739
Pearson          =  1.146326222                   (1/df) Pearson  =   1.146326

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.500876
Log likelihood   = -5.500875549                   BIC             =   .4575914

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.643628    .150451    -4.28   0.000    -.9385066   -.3487494
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1161478873691422
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.5537799  
Iteration 1:  Log likelihood = -5.5533033  
Iteration 2:  Log likelihood = -5.5533033  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.255593982                   (1/df) Deviance =   1.255594
Pearson          =  1.250823212                   (1/df) Pearson  =   1.250823

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.553303
Log likelihood   = -5.553303268                   BIC             =   .5624468

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6506846   .1504362    -4.33   0.000    -.9455342   -.3558349
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.1017323343473255
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.6085913  
Iteration 1:  Log likelihood = -5.6080257  
Iteration 2:  Log likelihood = -5.6080257  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.365038884                   (1/df) Deviance =   1.365039
Pearson          =  1.359923375                   (1/df) Pearson  =   1.359923

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.608026
Log likelihood   = -5.608025718                   BIC             =   .6718917

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6577588   .1504232    -4.37   0.000    -.9525829   -.3629348
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0873167813255089
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =   -5.66571  
Iteration 1:  Log likelihood = -5.6650435  
Iteration 2:  Log likelihood = -5.6650435  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.479074411                   (1/df) Deviance =   1.479074
Pearson          =  1.473634287                   (1/df) Pearson  =   1.473634

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.665043
Log likelihood   = -5.665043482                   BIC             =   .7859272

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6648507   .1504119    -4.42   0.000    -.9596526   -.3700489
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0729012283036923
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.7251374  
Iteration 1:  Log likelihood = -5.7243571  
Iteration 2:  Log likelihood = -5.7243571  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.597701616                   (1/df) Deviance =   1.597702
Pearson          =  1.591963896                   (1/df) Pearson  =   1.591964

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.724357
Log likelihood   = -5.724357085                   BIC             =   .9045544

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6719603   .1504023    -4.47   0.000    -.9667434   -.3771773
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0584856752818756
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.7868751  
Iteration 1:  Log likelihood =  -5.785967  
Iteration 2:  Log likelihood =  -5.785967  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   1.72092136                   (1/df) Deviance =   1.720921
Pearson          =  1.714920443                   (1/df) Pearson  =    1.71492

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.785967
Log likelihood   = -5.785966957                   BIC             =   1.027774

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6790876   .1503944    -4.52   0.000    -.9738552     -.38432
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.044070122260059
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.8509245  
Iteration 1:  Log likelihood = -5.8498735  
Iteration 2:  Log likelihood = -5.8498735  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.848734439                   (1/df) Deviance =   1.848734
Pearson          =  1.842512585                   (1/df) Pearson  =   1.842513

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.849873
Log likelihood   = -5.849873496                   BIC             =   1.155587

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6862325   .1503883    -4.56   0.000    -.9809881    -.391477
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0296545692382424
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -5.917287  
Iteration 1:  Log likelihood =  -5.916077  
Iteration 2:  Log likelihood =  -5.916077  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  1.981141359                   (1/df) Deviance =   1.981141
Pearson          =  1.974749177                   (1/df) Pearson  =   1.974749

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.916077
Log likelihood   = -5.916076956                   BIC             =   1.287994

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6933951   .1503838    -4.61   0.000    -.9881421   -.3986482
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.015239016216426
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -5.9859641  
Iteration 1:  Log likelihood = -5.9845776  
Iteration 2:  Log likelihood = -5.9845776  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.118142589                   (1/df) Deviance =   2.118143
Pearson          =  2.111639524                   (1/df) Pearson  =    2.11164

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   6.984578
Log likelihood   = -5.984577571                   BIC             =   1.424995

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7005754   .1503812    -4.66   0.000    -.9953171   -.4058338
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = -.0008234631946094
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -6.056957  
Iteration 1:  Log likelihood = -6.0553755  
Iteration 2:  Log likelihood = -6.0553754  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.259738347                   (1/df) Deviance =   2.259738
Pearson          =  2.253193165                   (1/df) Pearson  =   2.253193

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.055375
Log likelihood   =  -6.05537545                   BIC             =   1.566591

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7077734   .1503802    -4.71   0.000    -1.002513   -.4130336
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0135920898272073
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -6.130267  
Iteration 1:  Log likelihood = -6.1284706  
Iteration 2:  Log likelihood = -6.1284706  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.405928727                   (1/df) Deviance =   2.405929
Pearson          =  2.399420009                   (1/df) Pearson  =    2.39942

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.128471
Log likelihood   =  -6.12847064                   BIC             =   1.712782

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.714989    .150381    -4.75   0.000     -1.00973   -.4202477
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0280076428490239
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.2058955  
Iteration 1:  Log likelihood = -6.2038631  
Iteration 2:  Log likelihood = -6.2038631  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.556713673                   (1/df) Deviance =   2.556714
Pearson          =  2.550330303                   (1/df) Pearson  =    2.55033

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.203863
Log likelihood   = -6.203863113                   BIC             =   1.863566

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7222222   .1503835    -4.80   0.000    -1.016968   -.4274761
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0424231958708405
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.2838437  
Iteration 1:  Log likelihood = -6.2815527  
Iteration 2:  Log likelihood = -6.2815527  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   2.71209293                   (1/df) Deviance =   2.712093
Pearson          =  2.705934591                   (1/df) Pearson  =   2.705935

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.281553
Log likelihood   = -6.281552741                   BIC             =   2.018946

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7294731   .1503877    -4.85   0.000    -1.024228   -.4347187
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0568387488926572
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.3641126  
Iteration 1:  Log likelihood = -6.3615393  
Iteration 2:  Log likelihood = -6.3615393  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  2.872066095                   (1/df) Deviance =   2.872066
Pearson          =  2.866243762                   (1/df) Pearson  =   2.866244

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.361539
Log likelihood   = -6.361539324                   BIC             =   2.178919

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7367417   .1503936    -4.90   0.000    -1.031508   -.4419757
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0712543019144738
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.4467035  
Iteration 1:  Log likelihood = -6.4438226  
Iteration 2:  Log likelihood = -6.4438226  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.036632722                   (1/df) Deviance =   3.036633
Pearson          =  3.031269158                   (1/df) Pearson  =   3.031269

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.443823
Log likelihood   = -6.443822637                   BIC             =   2.343486

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   -.744028   .1504013    -4.95   0.000    -1.038809   -.4492469
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .0856698549362902
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.5316173  
Iteration 1:  Log likelihood = -6.5284022  
Iteration 2:  Log likelihood = -6.5284022  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.205791881                   (1/df) Deviance =   3.205792
Pearson          =  3.201022138                   (1/df) Pearson  =   3.201022

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.528402
Log likelihood   = -6.528402217                   BIC             =   2.512645

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7513319   .1504107    -5.00   0.000    -1.046131   -.4565324
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1000854079581068
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.6188553  
Iteration 1:  Log likelihood = -6.6152777  
Iteration 2:  Log likelihood = -6.6152777  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.379542914                   (1/df) Deviance =   3.379543
Pearson          =  3.375514833                   (1/df) Pearson  =   3.375515

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.615278
Log likelihood   = -6.615277734                   BIC             =   2.686396

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7586535   .1504218    -5.04   0.000    -1.053475   -.4638322
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1145009609799235
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.7084184  
Iteration 1:  Log likelihood = -6.7044486  
Iteration 2:  Log likelihood = -6.7044486  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.557884701                   (1/df) Deviance =   3.557885
Pearson          =  3.554759414                   (1/df) Pearson  =   3.554759

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.704449
Log likelihood   = -6.704448627                   BIC             =   2.864738

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7659928   .1504347    -5.09   0.000    -1.060839   -.4711463
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1289165140017401
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.8003076  
Iteration 1:  Log likelihood = -6.7959143  
Iteration 2:  Log likelihood = -6.7959143  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.740816047                   (1/df) Deviance =   3.740816
Pearson          =  3.738768482                   (1/df) Pearson  =   3.738768

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.795914
Log likelihood   =   -6.7959143                   BIC             =   3.047669

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7733498   .1504492    -5.14   0.000    -1.068225   -.4784747
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1433320670235567
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.8945236  
Iteration 1:  Log likelihood = -6.8896741  
Iteration 2:  Log likelihood =  -6.889674  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  3.928335497                   (1/df) Deviance =   3.928335
Pearson          =  3.927554885                   (1/df) Pearson  =   3.927555

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.889674
Log likelihood   = -6.889674025                   BIC             =   3.235188

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7807245   .1504655    -5.19   0.000    -1.075632   -.4858174
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1577476200453733
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -6.9910677  
Iteration 1:  Log likelihood = -6.9857272  
Iteration 2:  Log likelihood = -6.9857272  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   4.12044183                   (1/df) Deviance =   4.120442
Pearson          =  4.121132218                   (1/df) Pearson  =   4.121132

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   7.985727
Log likelihood   = -6.985727192                   BIC             =   3.427295

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7881168   .1504836    -5.24   0.000    -1.083059   -.4931744
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .17216317306719
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.0899403  
Iteration 1:  Log likelihood = -7.0840728  
Iteration 2:  Log likelihood = -7.0840728  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.317132974                   (1/df) Deviance =   4.317133
Pearson          =   4.31951373                   (1/df) Pearson  =   4.319514

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.084073
Log likelihood   = -7.084072763                   BIC             =   3.623986

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.7955269   .1505033    -5.29   0.000    -1.090508   -.5005458
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .1865787260890066
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.1911425  
Iteration 1:  Log likelihood =   -7.18471  
Iteration 2:  Log likelihood = -7.1847099  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.518407288                   (1/df) Deviance =   4.518407
Pearson          =  4.522713621                   (1/df) Pearson  =   4.522714

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =    8.18471
Log likelihood   =  -7.18470992                   BIC             =    3.82526

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8029546   .1505248    -5.33   0.000    -1.097978   -.5079314
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .200994279110823
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood =  -7.294675  
Iteration 1:  Log likelihood = -7.2876378  
Iteration 2:  Log likelihood = -7.2876378  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.724262993                   (1/df) Deviance =   4.724263
Pearson          =  4.730746473                   (1/df) Pearson  =   4.730746

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.287638
Log likelihood   = -7.287637773                   BIC             =   4.031116

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8104001    .150548    -5.38   0.000    -1.105469   -.5153314
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2154098321326396
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.4005383  
Iteration 1:  Log likelihood = -7.3928551  
Iteration 2:  Log likelihood =  -7.392855  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  4.934697508                   (1/df) Deviance =   4.934698
Pearson          =  4.943626575                   (1/df) Pearson  =   4.943627

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.392855
Log likelihood   =  -7.39285503                   BIC             =    4.24155

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8178633   .1505729    -5.43   0.000    -1.112981   -.5227458
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2298253851544563
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.5087334  
Iteration 1:  Log likelihood = -7.5003608  
Iteration 2:  Log likelihood = -7.5003608  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  5.149708955                   (1/df) Deviance =   5.149709
Pearson          =  5.161369453                   (1/df) Pearson  =   5.161369

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.500361
Log likelihood   = -7.500360754                   BIC             =   4.456562

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8253442   .1505995    -5.48   0.000    -1.120514   -.5301745
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2442409381762729
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.6192606  
Iteration 1:  Log likelihood = -7.6101536  
Iteration 2:  Log likelihood = -7.6101535  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =  5.369294415                   (1/df) Deviance =   5.369294
Pearson          =  5.383990108                   (1/df) Pearson  =    5.38399

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.610153
Log likelihood   = -7.610153484                   BIC             =   4.676147

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8328429   .1506279    -5.53   0.000    -1.128068   -.5376176
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Parm: z = .2586564911980895
Command is: glm d , family(binomial n) offset(__000004)    

Iteration 0:  Log likelihood = -7.7321208  
Iteration 1:  Log likelihood = -7.7222323  
Iteration 2:  Log likelihood = -7.7222321  

Generalized linear models                         Number of obs   =          2
Optimization     : ML                             Residual df     =          1
                                                  Scale parameter =          1
Deviance         =   5.59345171                   (1/df) Deviance =   5.593452
Pearson          =  5.611504823                   (1/df) Pearson  =   5.611505

Variance function: V(u) = u*(1-u/n)               [Binomial]
Link function    : g(u) = ln(u/(n-u))             [Logit]

                                                  AIC             =   8.722232
Log likelihood   = -7.722232132                   BIC             =   4.900305

------------------------------------------------------------------------------
             |                 OIM
           d | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.8403593    .150658    -5.58   0.000    -1.135643   -.5450751
    __000004 |          1  (offset)
------------------------------------------------------------------------------
.

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -0.8%") xline(-1.055610821517805
>  .1366534276068393, lstyle(ci) ) yline(-6.846235686798055, lstyle(refline) )

-------------------------------------------------------------
           d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
           z | -.4549134    .3041546    -1.055611    .1366534
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. 
. * poisson with exposure()
. clear

. input group pyears events

         group     pyears     events
  1. 0 200 38
  2. 1 100 19
  3. end

. poisson events group, exposure(pyears)

Iteration 0:  Log likelihood = -5.1354684  
Iteration 1:  Log likelihood = -5.1354681  

Poisson regression                                     Number of obs =       2
                                                       LR chi2(1)    =   -0.00
                                                       Prob > chi2   =  1.0000
Log likelihood = -5.1354681                            Pseudo R2     = -0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   1.10e-08   .2809757     0.00   1.000    -.5507023    .5507023
       _cons |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

. pllf, profile(group): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       group |  1.10e-08    .2828049    -.5712639    .5373108
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. pllf, profile(group) range(-1 1): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       group |  1.10e-08    .2827977     -.571238    .5373086
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. di r(asym)
-3.0607063

. pllf, profile([events]group) range(-1 1): poisson events group, exposure(pyears)
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[events]     |
       group |  1.10e-08    .2827977    -.5712379    .5373087
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. di r(asym)
-3.0606888

. assert reldif( `asym', r(asym)) < 1E-4 // fails at 1E-7

. 
. * profile the constant: two ways
. pllf, trace n_eval(10) debug profile(_cons): poisson events group, exposure(pyears)
Debug: parameter is _cons
Finding MLE using: poisson events group , exposure(pyears) 

Iteration 0:  Log likelihood = -5.1354684  
Iteration 1:  Log likelihood = -5.1354681  

Poisson regression                                     Number of obs =       2
                                                       LR chi2(1)    =   -0.00
                                                       Prob > chi2   =  1.0000
Log likelihood = -5.1354681                            Pseudo R2     = -0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   1.10e-08   .2809757     0.00   1.000    -.5507023    .5507023
       _cons |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

Profiling: using offset

Parm: _cons = -2.04226897740474
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -33.806113  
Iteration 1:  Log likelihood = -7.6538377  
Iteration 2:  Log likelihood = -7.5808641  
Iteration 3:  Log likelihood = -7.5807054  
Iteration 4:  Log likelihood = -7.5807054  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   2.77
Log likelihood = -7.5807054                             Prob > chi2   = 0.0963

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .3815377   .2294157     1.66   0.096    -.0681089    .8311843
    __000005 |          1  (offset)
------------------------------------------------------------------------------
:
_cons=-2.042269   PLL=-7.5807054


Parm: _cons = -1.95748280598834
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.880123  
Iteration 1:  Log likelihood = -6.7278477  
Iteration 2:  Log likelihood = -6.6548741  
Iteration 3:  Log likelihood = -6.6547154  
Iteration 4:  Log likelihood = -6.6547154  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   1.67
Log likelihood = -6.6547154                             Prob > chi2   = 0.1958

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .2967515   .2294157     1.29   0.196     -.152895    .7463981
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.9574828  PLL=-6.6547154


Parm: _cons = -1.872696634571941
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.157283  
Iteration 1:  Log likelihood = -6.0050075  
Iteration 2:  Log likelihood = -5.9320339  
Iteration 3:  Log likelihood = -5.9318752  
Iteration 4:  Log likelihood = -5.9318752  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.85
Log likelihood = -5.9318752                             Prob > chi2   = 0.3555

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .2119654   .2294157     0.92   0.356    -.2376812    .6616119
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.8726966  PLL=-5.9318752


Parm: _cons = -1.787910463155542
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.655568  
Iteration 1:  Log likelihood = -5.5032926  
Iteration 2:  Log likelihood =  -5.430319  
Iteration 3:  Log likelihood = -5.4301603  
Iteration 4:  Log likelihood = -5.4301603  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.31
Log likelihood = -5.4301603                             Prob > chi2   = 0.5793

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .1271792   .2294157     0.55   0.579    -.3224674    .5768258
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.7879105  PLL=-5.4301603


Parm: _cons = -1.703124291739142
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.394545  
Iteration 1:  Log likelihood = -5.2422691  
Iteration 2:  Log likelihood = -5.1692956  
Iteration 3:  Log likelihood = -5.1691369  
Iteration 4:  Log likelihood = -5.1691369  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.03
Log likelihood = -5.1691369                             Prob > chi2   = 0.8534

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |    .042393   .2294157     0.18   0.853    -.4072536    .4920396
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.7031243  PLL=-5.1691369


Parm: _cons = -1.618338120322743
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood =  -31.39551  
Iteration 1:  Log likelihood = -5.2432345  
Iteration 2:  Log likelihood = -5.1702609  
Iteration 3:  Log likelihood = -5.1701022  
Iteration 4:  Log likelihood = -5.1701022  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.03
Log likelihood = -5.1701022                             Prob > chi2   = 0.8534

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.0423932   .2294157    -0.18   0.853    -.4920397    .4072534
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.6183381  PLL=-5.1701022


Parm: _cons = -1.533551948906344
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.681646  
Iteration 1:  Log likelihood = -5.5293706  
Iteration 2:  Log likelihood = -5.4563971  
Iteration 3:  Log likelihood = -5.4562384  
Iteration 4:  Log likelihood = -5.4562384  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.31
Log likelihood = -5.4562384                             Prob > chi2   = 0.5793

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.1271793   .2294157    -0.55   0.579    -.5768259    .3224672
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.5335519  PLL=-5.4562384


Parm: _cons = -1.448765777489945
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.278186  
Iteration 1:  Log likelihood = -6.1259106  
Iteration 2:  Log likelihood = -6.0529371  
Iteration 3:  Log likelihood = -6.0527784  
Iteration 4:  Log likelihood = -6.0527784  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.85
Log likelihood = -6.0527784                             Prob > chi2   = 0.3555

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.2119655   .2294157    -0.92   0.356    -.6616121    .2376811
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.4487658  PLL=-6.0527784


Parm: _cons = -1.363979606073545
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -33.212596  
Iteration 1:  Log likelihood = -7.0603204  
Iteration 2:  Log likelihood = -6.9873468  
Iteration 3:  Log likelihood = -6.9871881  
Iteration 4:  Log likelihood = -6.9871881  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   1.67
Log likelihood = -6.9871881                             Prob > chi2   = 0.1958

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.2967517   .2294157    -1.29   0.196    -.7463983    .1528949
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.3639796  PLL=-6.9871881


Parm: _cons = -1.279193434657146
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -34.514772  
Iteration 1:  Log likelihood =  -8.362496  
Iteration 2:  Log likelihood = -8.2895225  
Iteration 3:  Log likelihood = -8.2893638  
Iteration 4:  Log likelihood = -8.2893638  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   2.77
Log likelihood = -8.2893638                             Prob > chi2   = 0.0963

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.3815379   .2294157    -1.66   0.096    -.8311844    .0681087
    __000005 |          1  (offset)
------------------------------------------------------------------------------
_cons=-1.2791934  PLL=-8.2893638

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -5.1%") xline(-1.994243617473411
>  -1.359486293743898, lstyle(ci) ) yline(-7.056197538295342, lstyle(refline) )

-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
       _cons | -1.660731    .1619309    -1.994244   -1.359486
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. local asym=r(asym)

. gen one=1

. pllf, trace n_eval(10) debug profile(one): poisson events group one, exposure(pyears) nocons
Debug: parameter is one
Finding MLE using: poisson events group one , noconstant exposure(pyears) 

Iteration 0:  Log likelihood = -84.716151  
Iteration 1:  Log likelihood = -5.2554669  
Iteration 2:  Log likelihood = -5.1356577  
Iteration 3:  Log likelihood = -5.1354681  
Iteration 4:  Log likelihood = -5.1354681  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(2)  = 157.21
Log likelihood = -5.1354681                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   3.44e-11   .2809757     0.00   1.000    -.5507023    .5507023
         one |  -1.660731   .1622214   -10.24   0.000    -1.978679   -1.342783
  ln(pyears) |          1  (exposure)
------------------------------------------------------------------------------

Profiling: using offset

Parm: one = -2.042268978345897
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -33.806113  
Iteration 1:  Log likelihood = -7.6538377  
Iteration 2:  Log likelihood = -7.5808641  
Iteration 3:  Log likelihood = -7.5807054  
Iteration 4:  Log likelihood = -7.5807054  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   2.77
Log likelihood = -7.5807054                             Prob > chi2   = 0.0963

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .3815377   .2294157     1.66   0.096    -.0681089    .8311843
    __000005 |          1  (offset)
------------------------------------------------------------------------------
:
one=-2.042269   PLL=-7.5807054


Parm: one = -1.957482806895991
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.880123  
Iteration 1:  Log likelihood = -6.7278477  
Iteration 2:  Log likelihood = -6.6548741  
Iteration 3:  Log likelihood = -6.6547154  
Iteration 4:  Log likelihood = -6.6547154  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   1.67
Log likelihood = -6.6547154                             Prob > chi2   = 0.1958

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .2967515   .2294157     1.29   0.196     -.152895    .7463981
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.9574828  PLL=-6.6547154


Parm: one = -1.872696635446085
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.157283  
Iteration 1:  Log likelihood = -6.0050075  
Iteration 2:  Log likelihood = -5.9320339  
Iteration 3:  Log likelihood = -5.9318752  
Iteration 4:  Log likelihood = -5.9318752  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.85
Log likelihood = -5.9318752                             Prob > chi2   = 0.3555

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .2119654   .2294157     0.92   0.356    -.2376812    .6616119
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.8726966  PLL=-5.9318752


Parm: one = -1.787910463996179
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.655568  
Iteration 1:  Log likelihood = -5.5032926  
Iteration 2:  Log likelihood =  -5.430319  
Iteration 3:  Log likelihood = -5.4301603  
Iteration 4:  Log likelihood = -5.4301603  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.31
Log likelihood = -5.4301603                             Prob > chi2   = 0.5793

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |   .1271792   .2294157     0.55   0.579    -.3224674    .5768258
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.7879105  PLL=-5.4301603


Parm: one = -1.703124292546274
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.394545  
Iteration 1:  Log likelihood = -5.2422691  
Iteration 2:  Log likelihood = -5.1692956  
Iteration 3:  Log likelihood = -5.1691369  
Iteration 4:  Log likelihood = -5.1691369  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.03
Log likelihood = -5.1691369                             Prob > chi2   = 0.8534

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |    .042393   .2294157     0.18   0.853    -.4072536    .4920396
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.7031243  PLL=-5.1691369


Parm: one = -1.618338121096368
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood =  -31.39551  
Iteration 1:  Log likelihood = -5.2432345  
Iteration 2:  Log likelihood = -5.1702609  
Iteration 3:  Log likelihood = -5.1701022  
Iteration 4:  Log likelihood = -5.1701022  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.03
Log likelihood = -5.1701022                             Prob > chi2   = 0.8534

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.0423932   .2294157    -0.18   0.853    -.4920397    .4072534
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.6183381  PLL=-5.1701022


Parm: one = -1.533551949646462
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -31.681646  
Iteration 1:  Log likelihood = -5.5293706  
Iteration 2:  Log likelihood = -5.4563971  
Iteration 3:  Log likelihood = -5.4562384  
Iteration 4:  Log likelihood = -5.4562384  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.31
Log likelihood = -5.4562384                             Prob > chi2   = 0.5793

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.1271793   .2294157    -0.55   0.579    -.5768259    .3224672
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.5335519  PLL=-5.4562384


Parm: one = -1.448765778196556
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -32.278186  
Iteration 1:  Log likelihood = -6.1259106  
Iteration 2:  Log likelihood = -6.0529371  
Iteration 3:  Log likelihood = -6.0527784  
Iteration 4:  Log likelihood = -6.0527784  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   0.85
Log likelihood = -6.0527784                             Prob > chi2   = 0.3555

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.2119655   .2294157    -0.92   0.356    -.6616121    .2376811
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.4487658  PLL=-6.0527784


Parm: one = -1.36397960674665
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -33.212596  
Iteration 1:  Log likelihood = -7.0603204  
Iteration 2:  Log likelihood = -6.9873468  
Iteration 3:  Log likelihood = -6.9871881  
Iteration 4:  Log likelihood = -6.9871881  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   1.67
Log likelihood = -6.9871881                             Prob > chi2   = 0.1958

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.2967517   .2294157    -1.29   0.196    -.7463983    .1528949
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.3639796  PLL=-6.9871881


Parm: one = -1.279193435296744
Command is: poisson events group , offset(__000005) noconstant   

Iteration 0:  Log likelihood = -34.514772  
Iteration 1:  Log likelihood =  -8.362496  
Iteration 2:  Log likelihood = -8.2895225  
Iteration 3:  Log likelihood = -8.2893638  
Iteration 4:  Log likelihood = -8.2893638  

Poisson regression                                      Number of obs =      2
                                                        Wald chi2(1)  =   2.77
Log likelihood = -8.2893638                             Prob > chi2   = 0.0963

------------------------------------------------------------------------------
      events | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       group |  -.3815379   .2294157    -1.66   0.096    -.8311844    .0681087
    __000005 |          1  (offset)
------------------------------------------------------------------------------
one=-1.2791934  PLL=-8.2893638

Drawing graph: graph twoway (line _pll _beta) ,  title("Asymmetry = -5.1%") xline(-1.99424361745443 
> -1.359486293742123, lstyle(ci) ) yline(-7.056197538295324, lstyle(refline) )

-------------------------------------------------------------
      events |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
         one | -1.660731    .1619309    -1.994244   -1.359486
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. assert reldif( `asym', r(asym)) < 1E-7

. 
. 
. * TRISST data, MRI vs CT comparison
. * NB it's a NI trial so don't get excited about the profile CI not crossing the null 
. *       NI margin is +0.057
. use ../TRISST, clear
(NI trial of MRI vs CT after testicular cancer. Margin: RD = +0.057. Joffe 2022.)

. pllf, norm verbose profile(modality): binreg outcome modality [fw=n], rd
Finding MLE using: binreg outcome modality [fweight= n], rd   

Iteration 1:  Deviance =  100.0224
Iteration 2:  Deviance =  100.0224

Generalized linear models                         Number of obs   =        669
Optimization     : MQL Fisher scoring             Residual df     =        667
                   (IRLS EIM)                     Scale parameter =          1
Deviance         =  100.0224151                   (1/df) Deviance =   .1499586
Pearson          =          669                   (1/df) Pearson  =   1.002999

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = u                       [Identity]

                                                  BIC             =  -4239.336

------------------------------------------------------------------------------
             |                 EIM
     outcome | Risk diff.   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    modality |  -.0178926    .009349    -1.91   0.056    -.0362163    .0004311
       _cons |   .0238806   .0083416     2.86   0.004     .0075313    .0402299
------------------------------------------------------------------------------
note: valid log likelihood not returned in e(ll);
if available, trying e(deviance) instead
Profiling:..........................................................................................
> ..........


-------------------------------------------------------------
profile lo~* |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0099405    -.0390899   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI
* defining log likelihood = -0.5*e(deviance)

. 
. 
. * TEST HANDLING INTERACTIONS
. use ../brcancer, clear
(German breast cancer data)

. stcox x2##x4a x5e x6 hormon, nohr

        Failure _d: censrec
  Analysis time _t: rectime

Iteration 0:  Log likelihood = -1788.1731
Iteration 1:  Log likelihood = -1728.5778
Iteration 2:  Log likelihood = -1723.7992
Iteration 3:  Log likelihood = -1723.7108
Iteration 4:  Log likelihood = -1723.7107
Refining estimates:
Iteration 0:  Log likelihood = -1723.7107

Cox regression with Breslow method for ties

No. of subjects =     686                               Number of obs =    686
No. of failures =     299
Time at risk    = 771,400
                                                        LR chi2(6)    = 128.92
Log likelihood = -1723.7107                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
          _t | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        2.x2 |   .5870545   .5007135     1.17   0.241     -.394326    1.568435
       1.x4a |   .9569604   .4215206     2.27   0.023     .1307952    1.783126
             |
      x2#x4a |
        2 1  |  -.5167128   .5151116    -1.00   0.316    -1.526313    .4928874
             |
         x5e |  -1.992496   .2260915    -8.81   0.000    -2.435628   -1.549365
          x6 |  -.0022597   .0005388    -4.19   0.000    -.0033157   -.0012037
      hormon |  -.3985667   .1279471    -3.12   0.002    -.6493383   -.1477951
------------------------------------------------------------------------------

. 
. * we can't profile the interaction parameter using new factor variables,
. * but we can using xi
. 
. * the easy way
. xi i.x2*i.x4a
i.x2              _Ix2_1-2            (naturally coded; _Ix2_1 omitted)
i.x4a             _Ix4a_0-1           (naturally coded; _Ix4a_0 omitted)
i.x2*i.x4a        _Ix2Xx4a_#_#        (coded as above)

. pllf, profile(_Ix2Xx4a_2_1) normal n_eval(20): stcox _I* x5e x6 hormon, nohr
Profiling:....................


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
_Ix2Xx4a_2_1 | -.5167128    .5245353     -1.59685    .4592907
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * the one-step way
. xi: pllf, profile(_Ix2Xx4a_2_1) normal n_eval(20): stcox i.x2*i.x4a x5e x6 hormon
i.x2              _Ix2_1-2            (naturally coded; _Ix2_1 omitted)
i.x4a             _Ix4a_0-1           (naturally coded; _Ix4a_0 omitted)
i.x2*i.x4a        _Ix2Xx4a_#_#        (coded as above)
Profiling:....................


-------------------------------------------------------------
profile lo~d |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
_Ix2Xx4a_2_1 | -.5167128    .5245353     -1.59685    .4592907
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
end of do-file
      name:  <unnamed>
       log:  c:\ian\git\pllf\testing\test_pllf.log
  log type:  text
 closed on:   4 Dec 2025, 17:08:16
----------------------------------------------------------------------------------------------------
