------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\ian\git\pllf\testing\TRISST.log
  log type:  text
 opened on:  16 Sep 2025, 12:35:04

. /*
> various ways to analyse TRISST
> IW 16sep2025
> */
. 
. cd "C:\ian\git\pllf"
C:\ian\git\pllf

. myadopath pllf
  [1]              "c:\ian\git\pllf"
  [2]  (BASE)      "C:\Program Files\StataNow19\ado\base/"
  [3]  (SITE)      "C:\Program Files\StataNow19\ado\site/"
  [4]              "."
  [5]  (PERSONAL)  "c:\ian\ado\personal/"
  [6]  (PLUS)      "c:\ian\ado\plus/"
  [7]  (OLDPLACE)  "c:\ado/"

. pda

. 
. use TRISST, clear
(NI trial of MRI vs CT after testicular cancer. Margin: RD = +0.057. Joffe 2022.)

. binreg outcome modality [fw=n], rd

Iteration 1:  Deviance =  100.0224
Iteration 2:  Deviance =  100.0224

Generalized linear models                         Number of obs   =        669
Optimization     : MQL Fisher scoring             Residual df     =        667
                   (IRLS EIM)                     Scale parameter =          1
Deviance         =  100.0224151                   (1/df) Deviance =   .1499586
Pearson          =          669                   (1/df) Pearson  =   1.002999

Variance function: V(u) = u*(1-u)                 [Bernoulli]
Link function    : g(u) = u                       [Identity]

                                                  BIC             =  -4239.336

------------------------------------------------------------------------------
             |                 EIM
     outcome | Risk diff.   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    modality |  -.0178926    .009349    -1.91   0.056    -.0362163    .0004311
       _cons |   .0238806   .0083416     2.86   0.004     .0075313    .0402299
------------------------------------------------------------------------------

. rdci outcome modality [fw=n]

Confidence intervals for risk difference

       Risk for unexposed (p0): 0.024
         Risk for exposed (p1): 0.006
     Risk difference (p1 - p0): -0.018

-----------------------------------------
         Method      [95% Conf. Interval]
-----------------------------------------
     Agresti-Caffo   -0.038         0.002
Newcombe Method 10   -0.041         0.002
       Wallenstein   -0.038         0.000
Miettinen-Nurminen   -0.041         0.001



. 
. * binreg succeeds:
. pllf, list profile(modality): binreg outcome modality [fw=n], rd
note: valid log likelihood not returned in e(ll);
if available, trying e(deviance) instead
Profiling...........................................................................
> .........................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -52.057029 |
  2. | -.0394368   -51.986412 |
  3. | -.0389926   -51.916666 |
  4. | -.0385484   -51.847807 |
  5. | -.0381042   -51.779851 |
     |------------------------|
  6. |   -.03766   -51.712812 |
  7. | -.0372158   -51.646708 |
  8. | -.0367716   -51.581555 |
  9. | -.0363273   -51.517371 |
 10. | -.0358831   -51.454173 |
     |------------------------|
 11. | -.0354389   -51.391979 |
 12. | -.0349947   -51.330808 |
 13. | -.0345505    -51.27068 |
 14. | -.0341063   -51.211615 |
 15. | -.0336621   -51.153631 |
     |------------------------|
 16. | -.0332179   -51.096751 |
 17. | -.0327736   -51.040996 |
 18. | -.0323294   -50.986387 |
 19. | -.0318852   -50.932948 |
 20. |  -.031441   -50.880701 |
     |------------------------|
 21. | -.0309968   -50.829671 |
 22. | -.0305526   -50.779882 |
 23. | -.0301084   -50.731359 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341548 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862    -50.52551 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0099405    -.0390899   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * glm fails for parm<=-0.03 ...
. pllf, list profile(modality): glm outcome modality [fw=n], family(binomial) link(i
> dentity)
Profilingconvergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
..............................................................................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -75.295161 |
  2. | -.0394368    -75.27109 |
  3. | -.0389926   -75.247364 |
  4. | -.0385484   -75.223988 |
  5. | -.0381042   -75.200966 |
     |------------------------|
  6. |   -.03766   -75.178301 |
  7. | -.0372158      -75.156 |
  8. | -.0367716   -75.134066 |
  9. | -.0363273   -75.112503 |
 10. | -.0358831   -75.091317 |
     |------------------------|
 11. | -.0354389   -75.070513 |
 12. | -.0349947   -75.050095 |
 13. | -.0345505   -75.030069 |
 14. | -.0341063    -75.01044 |
 15. | -.0336621   -74.991213 |
     |------------------------|
 16. | -.0332179   -74.972393 |
 17. | -.0327736   -74.953986 |
 18. | -.0323294   -74.935997 |
 19. | -.0318852   -74.918433 |
 20. |  -.031441   -74.901299 |
     |------------------------|
 21. | -.0309968   -74.884601 |
 22. | -.0305526   -74.868345 |
 23. | -.0301084   -74.852538 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341548 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862    -50.52551 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0075418    -.0296871   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. pllf, list profile(modality): glm outcome modality [fw=n], family(binomial) link(i
> dentity) difficult
Profilingconvergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
..............................................................................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -75.295161 |
  2. | -.0394368    -75.27109 |
  3. | -.0389926   -75.247364 |
  4. | -.0385484   -75.223988 |
  5. | -.0381042   -75.200966 |
     |------------------------|
  6. |   -.03766   -75.178301 |
  7. | -.0372158      -75.156 |
  8. | -.0367716   -75.134066 |
  9. | -.0363273   -75.112503 |
 10. | -.0358831   -75.091317 |
     |------------------------|
 11. | -.0354389   -75.070513 |
 12. | -.0349947   -75.050095 |
 13. | -.0345505   -75.030069 |
 14. | -.0341063    -75.01044 |
 15. | -.0336621   -74.991213 |
     |------------------------|
 16. | -.0332179   -74.972393 |
 17. | -.0327736   -74.953986 |
 18. | -.0323294   -74.935997 |
 19. | -.0318852   -74.918433 |
 20. |  -.031441   -74.901299 |
     |------------------------|
 21. | -.0309968   -74.884601 |
 22. | -.0305526   -74.868345 |
 23. | -.0301084   -74.852538 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341548 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862    -50.52551 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0075418    -.0296871   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. pllf, list profile([outcome]modality): glm outcome modality [fw=n], family(binomia
> l) link(identity)
Profilingconvergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
.convergence not achieved
..............................................................................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -75.295161 |
  2. | -.0394368    -75.27109 |
  3. | -.0389926   -75.247364 |
  4. | -.0385484   -75.223988 |
  5. | -.0381042   -75.200966 |
     |------------------------|
  6. |   -.03766   -75.178301 |
  7. | -.0372158      -75.156 |
  8. | -.0367716   -75.134065 |
  9. | -.0363273   -75.112503 |
 10. | -.0358831   -75.091317 |
     |------------------------|
 11. | -.0354389   -75.070513 |
 12. | -.0349947   -75.050096 |
 13. | -.0345505   -75.030069 |
 14. | -.0341063    -75.01044 |
 15. | -.0336621   -74.991213 |
     |------------------------|
 16. | -.0332179   -74.972393 |
 17. | -.0327736   -74.953986 |
 18. | -.0323294   -74.935997 |
 19. | -.0318852   -74.918433 |
 20. |  -.031441   -74.901299 |
     |------------------------|
 21. | -.0309968   -74.884601 |
 22. | -.0305526   -74.868345 |
 23. | -.0301084   -74.852538 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341547 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862   -50.525511 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
[outcome]    |
    modality | -.0178926    .0075418    -.0296871   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * ... unless you use irls ...
. pllf, list profile(modality): glm outcome modality [fw=n], family(binomial) link(i
> dentity) irls
note: valid log likelihood not returned in e(ll);
if available, trying e(deviance) instead
Profiling...........................................................................
> .........................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -52.057029 |
  2. | -.0394368   -51.986412 |
  3. | -.0389926   -51.916666 |
  4. | -.0385484   -51.847807 |
  5. | -.0381042   -51.779851 |
     |------------------------|
  6. |   -.03766   -51.712812 |
  7. | -.0372158   -51.646708 |
  8. | -.0367716   -51.581555 |
  9. | -.0363273   -51.517371 |
 10. | -.0358831   -51.454173 |
     |------------------------|
 11. | -.0354389   -51.391979 |
 12. | -.0349947   -51.330808 |
 13. | -.0345505    -51.27068 |
 14. | -.0341063   -51.211615 |
 15. | -.0336621   -51.153631 |
     |------------------------|
 16. | -.0332179   -51.096751 |
 17. | -.0327736   -51.040996 |
 18. | -.0323294   -50.986387 |
 19. | -.0318852   -50.932948 |
 20. |  -.031441   -50.880701 |
     |------------------------|
 21. | -.0309968   -50.829671 |
 22. | -.0305526   -50.779882 |
 23. | -.0301084   -50.731359 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341548 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862    -50.52551 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0099405    -.0390899   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
. * ... or set starting values
. pllf, profileoptions(from(0.04, copy)) list profile(modality): glm outcome modalit
> y [fw=n], family(binomial) link(identity)
Profiling...........................................................................
> .........................


     +------------------------+
     |  __000001     __000002 |
     |------------------------|
  1. |  -.039881   -52.057029 |
  2. | -.0394368   -51.986412 |
  3. | -.0389926   -51.916666 |
  4. | -.0385484   -51.847807 |
  5. | -.0381042   -51.779851 |
     |------------------------|
  6. |   -.03766   -51.712812 |
  7. | -.0372158   -51.646708 |
  8. | -.0367716   -51.581555 |
  9. | -.0363273   -51.517371 |
 10. | -.0358831   -51.454173 |
     |------------------------|
 11. | -.0354389   -51.391979 |
 12. | -.0349947   -51.330808 |
 13. | -.0345505    -51.27068 |
 14. | -.0341063   -51.211615 |
 15. | -.0336621   -51.153631 |
     |------------------------|
 16. | -.0332179   -51.096751 |
 17. | -.0327736   -51.040996 |
 18. | -.0323294   -50.986387 |
 19. | -.0318852   -50.932948 |
 20. |  -.031441   -50.880701 |
     |------------------------|
 21. | -.0309968   -50.829671 |
 22. | -.0305526   -50.779882 |
 23. | -.0301084   -50.731359 |
 24. | -.0296642   -50.684127 |
 25. |   -.02922   -50.638215 |
     |------------------------|
 26. | -.0287757   -50.593648 |
 27. | -.0283315   -50.550456 |
 28. | -.0278873   -50.508666 |
 29. | -.0274431   -50.468308 |
 30. | -.0269989   -50.429412 |
     |------------------------|
 31. | -.0265547   -50.392009 |
 32. | -.0261105   -50.356132 |
 33. | -.0256663   -50.321812 |
 34. | -.0252221   -50.289083 |
 35. | -.0247778   -50.257978 |
     |------------------------|
 36. | -.0243336   -50.228533 |
 37. | -.0238894   -50.200784 |
 38. | -.0234452   -50.174765 |
 39. |  -.023001   -50.150514 |
 40. | -.0225568   -50.128069 |
     |------------------------|
 41. | -.0221126   -50.107467 |
 42. | -.0216684   -50.088747 |
 43. | -.0212242   -50.071948 |
 44. | -.0207799    -50.05711 |
 45. | -.0203357   -50.044273 |
     |------------------------|
 46. | -.0198915   -50.033476 |
 47. | -.0194473   -50.024759 |
 48. | -.0190031   -50.018162 |
 49. | -.0185589   -50.013726 |
 50. | -.0181147   -50.011489 |
     |------------------------|
 51. | -.0176705   -50.011491 |
 52. | -.0172263   -50.013769 |
 53. |  -.016782    -50.01836 |
 54. | -.0163378   -50.025301 |
 55. | -.0158936   -50.034625 |
     |------------------------|
 56. | -.0154494   -50.046366 |
 57. | -.0150052   -50.060553 |
 58. |  -.014561   -50.077214 |
 59. | -.0141168   -50.096375 |
 60. | -.0136726   -50.118058 |
     |------------------------|
 61. | -.0132284   -50.142282 |
 62. | -.0127841   -50.169062 |
 63. | -.0123399   -50.198409 |
 64. | -.0118957   -50.230331 |
 65. | -.0114515    -50.26483 |
     |------------------------|
 66. | -.0110073   -50.301904 |
 67. | -.0105631   -50.341548 |
 68. | -.0101189   -50.383748 |
 69. | -.0096747    -50.42849 |
 70. | -.0092305   -50.475753 |
     |------------------------|
 71. | -.0087862    -50.52551 |
 72. |  -.008342   -50.577733 |
 73. | -.0078978   -50.632387 |
 74. | -.0074536   -50.689433 |
 75. | -.0070094   -50.748831 |
     |------------------------|
 76. | -.0065652   -50.810534 |
 77. |  -.006121   -50.874495 |
 78. | -.0056768   -50.940665 |
 79. | -.0052326   -51.008989 |
 80. | -.0047883   -51.079416 |
     |------------------------|
 81. | -.0043441   -51.151888 |
 82. | -.0038999   -51.226351 |
 83. | -.0034557   -51.302747 |
 84. | -.0030115   -51.381021 |
 85. | -.0025673   -51.461114 |
     |------------------------|
 86. | -.0021231   -51.542973 |
 87. | -.0016789    -51.62654 |
 88. | -.0012347   -51.711762 |
 89. | -.0007904   -51.798585 |
 90. | -.0003462   -51.886956 |
     |------------------------|
 91. |   .000098   -51.976825 |
 92. |  .0005422   -52.068142 |
 93. |  .0009864   -52.160859 |
 94. |  .0014306   -52.254929 |
 95. |  .0018748   -52.350307 |
     |------------------------|
 96. |   .002319    -52.44695 |
 97. |  .0027632   -52.544815 |
 98. |  .0032075   -52.643863 |
 99. |  .0036517   -52.744054 |
100. |  .0040959   -52.845351 |
     +------------------------+

-------------------------------------------------------------
     outcome |     Coef.   Std. Err.     [95% PLL Conf. Int.]
-------------+-----------------------------------------------
    modality | -.0178926    .0099405    -.0390899   -.0001239
-------------------------------------------------------------
Note: Std. Err. is pseudo standard error, derived from PLL CI

. 
end of do-file
      name:  <unnamed>
       log:  C:\ian\git\pllf\testing\TRISST.log
  log type:  text
 closed on:  16 Sep 2025, 12:42:33
------------------------------------------------------------------------------------
